musings_log.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-12 Thu 01:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://mitchmarq42.xyz/style.css" />
</head>
<body>
<div id="content">
<div id="outline-container-orgbe787b4" class="outline-2">
<h2 id="orgbe787b4">12-28-2021 9:45 pm</h2>
<div class="outline-text-2" id="text-orgbe787b4">
<p>
Just deleted reddit. u/KasaneTeto_ was banned and I have no reason to live.
</p>

<p>
<code>Oh take me higher, all the way to the sun! (song)</code>
</p>

<p>
Was I wrong to push Miguel on the ice? Or was he wrong to resist? He did 
nothing. He did what he did, and let others speak for him. In the end I spoke 
against him. How would my father speak of me? Would I dare refute him? 
</p>

<p>
<code>Down to the wire, fighting's only begun! (song)</code>
What is a good exercise? Stairs? Worth a shot.
New years possibly: log the best moment of every day. Compare at end.
</p>

<p>
Everything I am in or a part of is fragile and janky and disgusting. Are my 
eyes dry and blurry? Am I fat? Is my penis short? Am I bad with humans? Or is 
this all an existential illusion? What of memories, what of refactored 
expectations?
I don't want friends who don't keep in touch. But I want to continue the 
experience of being friends with them. I have no one else right now. Least of 
all them.
</p>

<p>
<code>Oh take me higher, yeah I'm under the gun! (song)</code>
</p>

<p>
All everything unequal friendship is all is mutilation manipulation emotional 
extortion. Fake. Too straight to exist. Innocence is a vacuum, a balloon, the 
best you can do is relieve its existential impossibility gently. Poke it with a 
needle soaked in handsan, bleed in some noble gases, let the truth show itself. 
But the truth is bad and must die. Such horrible stupid things must be 
unwritten from creation. Yet they arise logically. I guess I must praise them 
then. But none of this is logical! It must not be! Causality is an illusion! 
<code>God was a girl, the devil wore a t-shirt, love is a game and</code>
</p>

<p>
 I could have had her. If I hadn't been a creep, if I tried just a bit, if I 
had any fucking awareness of my situation and played it right, she would have 
fallen for me! But I didn't get it, too little too late, then way too much, and 
suddenly it's awkward and I'm filled with regret. No matter what there's 
regret. I deny it I avoid it, I categorize and minimize, but I hate it. I 
regret. I lost Mary Alice.
But hey, I have everything else. Living by the seat of my pantsu. No real 
backup plans, but kamisama won't let me die. Won't let me fail. Everybody loves 
me, or they leave me. Or they hate me but love a version of me that I can 
pretend to be at parties, which is good enough.
Mthats all for now. Good night. The female body makes no sense. Might elaborate 
later. For now, anxiously laying awake. Gonna wake up 20min before the alarm, 
waste it all like I've done for 2 months, get to work 5min late. Might 
reinstall reddit, but at least it'll take annoying time to download. Put in 
15min of good work, play 5hr of 2048, get free lunch, listen to Jon rants, call 
it a productive day.
</p>

<p>
<code>_/dance fucker dance let the motherfucker burn/</code> (song) 
</p>

<p>
Let the record show that at no point did I go a year without breaking every 
promise I ever made to myself. The devil's water ain't that sweet, but I guzzle 
it just the same. Am I a narcissist? Is everyone? Maybe. I appreciate aspects 
of my physicality that humans apparently distaste even for their own selves. My 
farts are annoying but at least they're mine. Well, sometimes others have ones 
that are the same. Which are hard to enjoy. Gosh I actually just typed that 
out. My left arm is getting numb.
</p>

<p>
<code>/ah ah ah/ well we're pouring gasoline, so dance through the fire that we once 
believed in! (song)</code>
</p>

<p>
Journals are stupid. Summariacal historical fiction is stupid. Reduction of any 
kind is stupid. If the thing isn't simple enough to say it has no right to 
exist. What am I then? The pinnacle of accursed improbable complexity.
</p>

<p>
But that's reductive. Patrick. I sound like regulus Cornelius in my head. Well 
this isn't my head. This is why I don't let my thoughts make it into English. 
As I told Angel, it's a hurricane in there. The I that I call myself sits in 
the eye, bewildered. I'm like rimuru, I take in everything and analyze it in 
the background and churn it all together and make new things. I hate when 
people disagree because that is the cause of my uncertainty. I've been wrong, 
now I pay the price. I will not let me make the wrong assumption.
</p>

<p>
But you can't derive objectivity from random human opinions. There is no 
algorithm for truth, as Tom Scott probably said. So what? I don't care about 
their truth. I'll find the real underlying factuality of everything.
</p>

<p>
This feels like some Till We Have Faces bullshit. I loved that book and I will 
find my face if I have to tear it off. I will lay bare my complaint before God 
and man, and lay it out by my lonesome with my dearest friends, and it will be 
the Ultimate Question. My great request before kamisama. Give me the truth, let 
me be it. That is what I want. But apparently that seat is already taken. There 
is nothing more for me then. Yet here I am, just to suffer. A foolish wise man, 
the least endowed among the gifted, an autistic normie, an aggrandizing 
dissenter. A sanctimonious pervert. The employed neet. Yet I am nothing, and I 
am without christ. Because of course. Hell take me back.
</p>

<p>
<code>Oh take me higher (song)</code>
</p>

<p>
<code>But they'll never throw it back to you (song)</code>
</p>

<p>
Well I've been writing on here for a whole hour now. It's a date. Good night 
for realizes.
</p>
</div>
</div>

<div id="outline-container-org0fe6b17" class="outline-2">
<h2 id="org0fe6b17">2021-12-29 7:26 am</h2>
<div class="outline-text-2" id="text-org0fe6b17">
<p>
Woke up at 7:18. Was having a dream in which Lillian wanted to have sex with 
me. I had to pee first, and that's when I woke up. Her act of choosing me 
seemed unexpected, and she did it publicly and decisively and suddenly, and I 
was shocked because I hadn't even hoped for that outcome. I had (apparently in 
the dream) been fairly certain she would choose Charles or someone else. Yet, 
in that moment she tapped my downturned head, I felt inevitability. I felt 
power. Vindication. Yet not really surprise. I had expected this, somehow. 
Well, we got into the tent, turned away to disrobe, I found a urinal and woke 
up to the lonely dark me with an erect penis and a full bladder. Which is just 
the worst. Now I'm writing more in here. Kinda worried that this document will 
be huge by the end.
</p>
</div>
</div>

<div id="outline-container-org27603c4" class="outline-2">
<h2 id="org27603c4">2021-12-29 8:21 am</h2>
<div class="outline-text-2" id="text-org27603c4">
<p>
Just got to work. Already bored. And no reddit, how about that. Gonna open 
termux and do some customization in that. Probably fix my dotfiles updation and 
stuff.
</p>
</div>
</div>

<div id="outline-container-orga5ba41c" class="outline-2">
<h2 id="orga5ba41c">2021-12-29 9:42 am</h2>
<div class="outline-text-2" id="text-orga5ba41c">
<p>
Stage plays are really something. How can the audience suspend their disbelief? 
When I watch an anime, I believe it's happening. Not in a grasp able way, but 
there is some world in which everything basically holds together and makes 
sense. But on the stage, you know the humans. You painted the backdrops. You 
argued with the director about the direction of the script. Even a Hollywood 
movie&#x2013; the best they can do is a retelling. But anime/manga/prose is real. 
More real than this world, I wish. You can make it make sense. And that which 
makes sense, can be loved. I do not love reality. Do I? Maybe I do. I also hate 
it too. Of course.
</p>

<p>
~(song) hey don't let it go to waste. I love it but I hate the taste&#x2026; ~
</p>

<p>
Chemistry, says The Martian, is a bitch. And this sekai is made of chemistry. 
Thus, this sekai is a bitch. Gotta learn Japanese here pretty soon.
</p>
</div>
</div>
