musings_log.html

<div id="outline-container-org61f1371" class="outline-2">
<h2 id="org61f1371">2021-12-29 10:25 am</h2>
<div class="outline-text-2" id="text-org61f1371">
<p>
My mind is surprisingly clear right now. And how? I don't doubt nothing about 
it feels like words and things and stuff. So full I can't eat. My throat 
recoils at the mere thought. And yet I will eat again, I will enjoy it, I will 
force the stuff down my neck into this ever-expanding belly. And I will spend 
money on this, and find no contradiction.
</p>

<p>
<code>(song) I'm better off all by myself, though I'm felling kinda lonely without 
somedy else...</code>
</p>

<p>
There's a hum at the back of my hearing. No particularly shrill, just high, not 
noticeable unless I decide to notice it. Maybe it's only here at the office. 
The cum total of all fake sound and light and knowledge. An illusion. An 
ellision. Oh the humanity. I hates them, I do. Yet without them I d surely be 
bored. Send me another word, say something I haven't heard. How is true remains 
just fine, nothing I do is worth an inch of catharsis. Slime Isekai was a great 
show. I hope it goes on forever without becoming an awfully paced parody of 
itself like Conan did&#x2026; Same with Overlord. Although, overlord is already a 
parody so it'll probably be fine. Worst that could happen is filler. No. 
Worried about re:zero, Subaru is turning into Charles. Not Gary level yet so 
they're both OK to save. Save from what? Let them wreak their havoc. They will 
see their error, and come crawling back to&#x2026; Me? Nah. What was I to them? A 
simple prop, a gullible little guy. This one goes out to the ones I left ahead 
left for dead all comes back to me in the end I kept every thing inside and 
even though I tried it all fell apart what it meant to be will eventually be 
the memory of the time I tried to hard and got so far. Thank you Jonas. Miss 
Jonas. Wish we had something in common, he was a good guy. Too good for the 
likes of me. He won, I lost. I lost, how could I count the cost. All well that 
ends well and this didn't so thats just as well hope it gives you hell.
</p>
</div>
</div>

<div id="outline-container-org02e5227" class="outline-2">
<h2 id="org02e5227">2021-12-29 11:16 am</h2>
<div class="outline-text-2" id="text-org02e5227">
<p>
Slime was such a Good show. Is such a good show. Wish I could go back and watch 
it again. Need moar. I want to watch them all. But only the good ones. 
</p>
</div>
</div>

<div id="outline-container-orgb2c7ee0" class="outline-2">
<h2 id="orgb2c7ee0">2021-12-29 12:24 pm</h2>
<div class="outline-text-2" id="text-orgb2c7ee0">
<p>
Jon tells me the world was once free. How disturbing.
</p>
</div>
</div>

<div id="outline-container-org4fccdb9" class="outline-2">
<h2 id="org4fccdb9">2021-12-29 8:48 pm</h2>
<div class="outline-text-2" id="text-org4fccdb9">
<p>
Ate probably too much today. Bought a carpet and it is nice. Also tried to 
submodule-ize my .config/nvim and did, but now am concerned about updation. I 
want it to act like a slave to the main dotfiles repo, but git doesn't quite 
intend for that to be how it works. My command line options are broken for the 
custom dots() function so oops gotta fix that. Today was slow but tiring. Not 
having reddit may have been an improvement.
</p>

<p>
I broke down a few minutes ago. I looked up something related to an anime. 
Specifically, who tf is Flugel? Is he Subaru? OK who cares. Turns hout he's the 
guy with the tree. Man that world has a lot going on. Ehh. Slime is fresh in my 
mind and the conclusion is satisfying, so I deem it better. But as 
</p>

<p>
<i>Gigguk never said:</i>
</p>

<p>
/before having shitty taste, /
</p>

<p>
<i>One must first taste shit.</i>
</p>

<p>
Haiku is so dead
</p>

<p>
We have killed him, you and i
</p>

<p>
Yet we feel no shame
</p>

<p>
Now I'm thinking in 575 and the words aren't coming and here they start coming 
got fed to the rules and I was pooped out inevitably. Woofda. Stomach is so 
full. And I drank a Dew and everything. Got a 24 pack at Fred myer. $11. Great 
deal. Not quite so good as the last one (that was 48 for $12) but still 
remarkable. Seriously need a better network connection, this is ridiculous. I'm 
at 101 gigs this month. Bye now. Gonna waste some time on YT. Make it 103 gigs. 
Night.
</p>
</div>
</div>

<div id="outline-container-org13e0eb1" class="outline-2">
<h2 id="org13e0eb1">2021-12-30 7:50 am</h2>
<div class="outline-text-2" id="text-org13e0eb1">
<p>
Went to bed late and woke up early. Am I evolving? Is this my life now? Or is 
it the caffeine? Perhaps the stress or something. Anyway. Successfully 
submoduled my nvim config so that's nice. Also conan-dl I threw out the old one 
saving it of course so that might work. I kind of understand sed now so that 
helps. Also gonna try to eliminate ambiguity, duplicate operations, and 
non-"functional" code. Everything will be a function. The functions will each 
take a set of arguments, and if they contain any custom functions within them 
those will also be the same way. The Process section will be a single 
invocation. I gotta go to work bye.
</p>
</div>
</div>
