org/musings_log.org
* 2021-12-31 9:34 pm
So close to the new year.I'm tired. My ears hurt from these headphones. Truly I 
ask, seeking no answer: are there any headphones that don't do this? Earbuds 
don't count since they are garbage and make my brain hurt. The ears are just 
cartilage so it's not as viscerally big a deal. May be worse in the long run, 
or whatever. I'm afraid I might have bedbugs, but if they don't bother me I'll 
harbor them a little longer. With a low enough frequency and small size, bugs 
aren't a big deal. It's when they grow up into visually-discernable monsters or 
autonomous swarms that they become an existential threat. There was a video on 
reddit a while back: a centipede the size of a terrier. The thing was red and 
black and yellow. It had flat vantablack eyes and its body was like a human 
spine and ribcage watched Parasyte the Maxim and got possessed by an 
arch-demon. But it was chill. Probably on a higher intelligence level than the 
dog getting mad at its existence. They say those things eat smaller bugs and 
mice etc. So basically a horror cat. Actually pretty metal, and kills several 
birds with one existential horror, but not for me. Freaks me out. Those 
creatures are made for a harsher world, where they reign supreme. They still 
live in that harsher world, but they've been hopelessly out-evolved by what to 
them must seem eldrich lovecraftian horrors. Just look at the Lego Movie: the 
hand of the builder in Emmet's vision is compared to a squid/octopus. But I 
digress. The connection borders on contrivance.
Really dig my new carpet. Need a few more. Do not dig that shower curtain. It's 
scary. That's lovecraftian too. Shit I'm overusing that term now. Whatever. The 
framing device has not yet been abandoned, so I'm probably safe for now. Not 
that I'd mind being isekai'd. But for now it seems I must start life in the 
real world from now. Re:zero was the perfect wake up call for my fragile mind. 
It was something, and that was all I needed. Hope Lillian is okay, she hasn't 
responded to me. Whatever. If it's best for her to not interact with me, I 
could not forgive myself for interfering. Hmm. I'm an inconstant man, I 
probably could. I've made peace with everything up till now. Lazy is as lazy 
does, they may say. Still, it could be worse:

[story name="musings of a fly on the wall" note="May revisit later" ]
#+begin_src
The Atheist sat down. He sat on a chair. It was a wooden chair. It was a wooden 
chair with thick arms and thin round legs and spines on the back. It was sloped 
back and the seat was carved out. In fact it was a remarkably pleasant chair, 
doubly so for having no fabric or foam padding. Yet the Atheist felt nothing as 
he sat. It was a slow but not at all deliberate sort of a sit, as one does when 
upon first leaning their hands onto the back a chair, they glacially yet 
fluidly morph into a sitting position.
But surely, you say, he must have felt something! No. Nothing. The human body 
cancels out any pain it cannot control or has decided to put up with. Even 
standard sitting pinches the skin and compresses the flesh in ways that should 
elicit a reflexive discomfort, yet this is far out-matched by the comfort the 
rest of the body feels. In a similar way, this man had blocked out any comfort 
he would have felt.
The chair let out a soft and dirty squeak as its occupant reached forward. The 
latter's boots, rubber-soled and slightly damp from the outside snow and salt, 
squelched eagerly backwards into the white industrial tile floor. Then they 
relaxed and the chair let out another groan of ecstasy as it was slid forward. 
There was a flicking noise as the man re-focused the page in his left hand.
"You are cordially invited to the 12th annual celebration", the extravagant and 
barely-legible Microsoft font declared through its lined and fading dark-cyan 
laser ink, "of the end of the world." 
Below this were instructions on how to arrive at and gain entry to the venue, 
as well as a hand-scribbled assurance from the hostess's husband that the 
brochure's recipient was always welcome at their table.
Still sitting in the chair, the man raised one knee, bent his foot in, and 
rested that foot's ankle atop the other knee.
"Well," he wearily declared, "that will be an affair of three wasteful hours 
and several hundred dollars. But I may as well attend. I've got nothing else to 
do that evening."
#+end_src
[/story]
I love writing. But also it's painful and time consuming and fake. Whatever. I 
don't plan out stories, I just set things in motion and hope the lore will 
write itself. Thankfully my mind multitasks enough that it usually does. Sadly 
the actual story never gets finished.

* 2022-01-01 12:21 am
#+begin_src
<song>that's me in the corner
That's me in the spotlight
Losing my religion.
Trying to keep up with you
And I don't know if I can do it
Oh no I've said too much
I said it all
</song>
#+end_src
Starting today, I will write in here what the best thing I accomplished each 
day was. I will go into as much detail as is necessary for later recollection. 
I will save charting and analyzing progress for the future. Three toasts to the 
city:
1. A year of idle satisfaction
2. A year of humanity's growth
3. A year of personal fulfillment
Or something. I forgot the wording. That was the gist, and none live to 
remember the event. Well it's been a doozie. No idea what that means, so it 
means whatever I want it to. We wrapped up a lot of long arcs and sub-plots, 
and started several more. I feel silly saying that. Nandemonai desu. Orei wa 
mou shinderu. That's not fair, I still have a full life ahead. If I don't get 
eaten by ephemeral bedbugs or ravaged by Truck-kun's embrace or sniped by 
glowies or shut out and frozen to death. Daijobu desu. My eyesight is actively 
getting worse. I ignore it. I guess having glasses would be fun. Needing them 
would be awful though. Best would be to get a prescription right now that does 
basically nothing, just slightly improves sharpness. Then I can function 
equally with and without. 2 identities? Rest of my appearance isn't malleable 
enough. Need to trim this fat. Brodie the inverted drunkard on Arch says keto 
makes you lose weight. Diets are for middle aged women. I don't get it. I 
should monetize or at least advertise myself. I have one viewer of my github 
and zero on my website. It's literally just me. Which is nice but garbage. Also 
haven't pushed to youtube in forever. Nothing to say. Hey hey.

* 2022-01-01 8:46 am
Just woke up. So tired. Man, all nighters are overrated. Already, I've started 
to redo conan-dl in python. This is the furthest I've ever gotten.

* 2022-01-01 12:03 pm
Just picked up a used knife block from the share nook (temporary name). Knives 
are chilling in the sink. Kinda worried that will do sth bad to them, but they 
appear to have had rough lives so far anyway. I don't think it'll be that big a 
deal. I lined all the handles up so it's almost safe to reach in there. Also 
doing laundry. Hypothetical bedbugs haven't shown themselves yet so I'll 
pretend I'm safe. Washing the shirt but not the pants. They smell less and are 
not as noticeable.

