org/musings_log.org
* 2022-01-01 11:53 pm
The bedbugs have shown themselves. I did some laundry and took a nice long 
bath. We have now reached a hostile truce to make useless shots at each other 
until either they amass enough members to drain me of blood, or I draw forth 
building management to smoke them out and freeze dry every last one. In the 
mean time, today. Best thing I'm proud of. Cleared all the mtn dew cans off the 
windowsill. That was an achievement. Also the bath was really soothing. 
Rewriting conan-dl in python is going to be painful, but I will learn this 
language. Must sleep.

* 2022-02-01 8:17 pm
I'm full. That makes me tired. Mac n cheese is truly remarkable as a general 
sedative, at least to my body these past few years. Dad just texted and Shannon 
cheated on Tammy. With Andrea. Truly there is no hope for humanity. Men and 
women cannot be friends. Everything always has a sexual charge. The only 
possible exception is "the forbidden degree", but even that is a social 
construct. Lack of lust towards close family is but a repression. A deeper 
repression than the standard self-cockblocking by which standard rape is 
avoided. The understanding is that there is no even hypothetical consent. 
Because, You Just Don't Go There. You Can't. That's Wrong.
This explains why step family porn and ecchi anime exist, and why they are so 
popular. We hate its brashness, we get over it mostly because of plot or more 
comfortable sexual scenarios, we quietly enjoy that "forbidden" aspect while 
pretending to righteously despise it, but we also justify it with "but they're 
not blood related". I wouldn't say this is universal, but it is common for 
people with a standard-ish heterosexual drive. Normal people, we could say.
The elephant in the room here, on a related note, is of course the attraction 
to children. Obviously this is messed up, it is "forbidden", and this is also a 
not entirely self-evident or consistent matter. We can divide the lolicon (or 
shotacon, or predator, whichever term you prefer: though there is undoubtedly a 
distinction) into two categories: the okay (slightly-confused) ones and the 
not-okay (scum of the earth) ones. The okay ones have a complex something like 
this:
They sexually identify as a peer to the object of desire. The "I wish I were 
her age" guys. These are the sort of guys those vigilante cringe youtube dads 
entrap and lecture. They're just larping, and they have enough other problems 
to sometimes take that larp to illegally serious levels.
The not-okay ones have a far worse complex: they enjoy exerting power over 
weaker beings. They enjoy being dominant over powerless helpless ignorant 
delicate beings. The sexualized form of the "tortures small woodland animals as 
a teenager and grows up to be a dictator" trope. That trope also has 
distinctions to be made, particularly in the case of Peter the Hegemon (of 
enders fame) who redeemed himself and actually turned out kind of okay and 
redeemed himself. But anyway. What makes these guys so hatable is their 
entitlement, that clouds even self-awareness. The smarter ones never get 
caught, or go free, because they spend all that extra brainpower protecting and 
justifying their sore-loser caveman drives. While the other type longs for a 
love that cannot be, these monsters have given up on-- or never knew-- love at 
all. For them, their actions are stop-gaps for the infinite hole of ambition 
and lust. I bet if one of these guys were to literally rule the world, and 
remake it in his own image, and fuck every single girl on her 9th birthday, he 
would still not be satisfied. Something made him this way, but this cannot 
excuse his continued pursuit of these desires. Okay, I think I'm getting 
extreme here. That example was too colorful.

* 2022-01-02 9:16 pm
Welp. Work is tomorrow.
Best thing I did today: disable mouse clicks in vim insert mode. Tiny thing, 
literally one character fix, but has bothered me for weeks. Also crushed the 
last of the cans I had brought to the car. Also texting dad was kind of a 
relief.
I'm gonna get my makeshift pj's on and fill out som MC Donald's receipts. Night.

* 2022-01-03 9:18 am
$2500 pay for December including Christmas bonus. Nice. Gonna live off $400 
this month. Nifty.

* 2022-01-03 11:23 am
#+begin_src
<story part=2 name="musings of a fly on the wall" >
As the Atheist left, he noticed a black mark on the dingy but clean beige wall. 
He smacked it and it smeared and died. The end. 
</story>
#+end_src

* 2022-01-03 9:46 pm
Best thing of day: cleaning apartment in preparation for bedbug heat death. 
Also getting paid was super nice. Christmas bonus ftw. In the morning I will 
leave my door unlocked. In the evening I will dine with Macklen. At the end I 
will return and reassemble my scattered belongings. I hope the laptops survive 
the fridge for 24 hours. Eh, should be mostly fine. Anime is a lie and I can't 
get enough. Good night.

* 2022-01-05 7:32 am
Forgot to say best thing of yesterday. How about, dinner with Macklen. Eh. Not 
actually proud of it, but nothing else springs to mind..

* 2022-01-05 8:18 am
Not going to work. Well, maybe in the afternoon when nothing will get done. The 
bugs apparently do not die when they are killed, so that has been unfortunate. 
I caught another one, but that was my only Tupperware so now I can't eat. 
Whoops. Probably will go for a nice long fast-food parking lot run and waste 
some fuel. For now, time to see if the laptops still work after being fridged...

