musings_log.html

<div id="outline-container-org8cda1ce" class="outline-2">
<h2 id="org8cda1ce">2022-01-05 10:04 pm</h2>
<div class="outline-text-2" id="text-org8cda1ce">
<p>
Did nothing. Feel nothing. Cthulu and the futility of life burn large on my 
brain. Garfield is an eldrich god that torments Jon. Roko's Basilisk is a 
strawman fallacy cringe. All cringe is post cringe. We want to be Garfield. I 
want to be an eldrich horror. I care not for the lives of men. Let them die! 
This is my take on abortion. It is idiotic in the contemporary sense to say 
that the "fetus" is not alive, is not genetically distinct, is not ningen. It 
is idiotic in the Greek sense (selfish) to kill it. As far as facts, I take the 
simpler side: it is a unique and distinct human. As far as actions, I take the 
simpler side: it is expedient to terminate it for the sake of convenience. 
Thus, to murder. Maybe call it manslaughter. Maybe the term murder should be 
reserved for killing without motive, or without planning, or without properly 
weighing outcomes. Let them die. People should accept that intercourse leads to 
the creation of a new human life, and this is fine. If you want to sex that 
badly, go ahead. Kill it. Already, no one wants abortions. It is a backup, a 
last resort. Murder is always the last resort. With this model, we may fix the 
heart of the intellectual disparity - - albeit sacrificing the perceived 
morality altogether. But morality is already dead. It's 2022 after all. May as 
well kill it. It has no regrets. It deserves a state of eternal choicelessness 
more than the pain of earthly toil. Let it die. If it dares exist. Anyway. I'm 
getting too based to keep around. Better quit.
</p>
</div>

<div id="outline-container-org3f30c94" class="outline-3">
<h3 id="org3f30c94">Best thing today:</h3>
<div class="outline-text-3" id="text-org3f30c94">
<p>
bought broom. Not using it, but bought it at least. Pathetic. What you will.
</p>
</div>
</div>
</div>

<div id="outline-container-org1c2f9c6" class="outline-2">
<h2 id="org1c2f9c6">2022-01-06 8:45 am</h2>
<div class="outline-text-2" id="text-org1c2f9c6">
<p>
Bright and early. Too late to change a thing. We waste so much storage here. 
Stupid one-time-write discs. We hates them, but actually no, they have their 
purpose. Ech. Ick. Itch. Scratch. Slap. Pinch and twist. r/goodnightreddit. 
Woosh. Will nothing rid me of this troublesome infestation! Let them die too.
</p>
</div>
</div>

<div id="outline-container-orgaf8e708" class="outline-2">
<h2 id="orgaf8e708">2022-01-07 6:45 am</h2>
<div class="outline-text-2" id="text-orgaf8e708">
</div>
<div id="outline-container-org22fa726" class="outline-3">
<h3 id="org22fa726">Best thing of yesterday:</h3>
<div class="outline-text-3" id="text-org22fa726">
<p>
 not giving up. Work was stressful. It always is when Josh comes in.
So today is Friday. Let's hope the exterminators actually come and do their 
thing. I wouldn't mind everything getting messed up if it means the bugs die.
</p>
</div>
</div>
</div>

<div id="outline-container-orged044b5" class="outline-2">
<h2 id="orged044b5">2022-01-07 11:22 pm</h2>
<div class="outline-text-2" id="text-orged044b5">
</div>
<div id="outline-container-org19b7ec1" class="outline-3">
<h3 id="org19b7ec1">Best thing of today:</h3>
<div class="outline-text-3" id="text-org19b7ec1">
<p>
actually finished lunch. Miserable. I'm so fat. Also
</p>

<p>
Might not sleep tonight. The conspiracy theory iceberg has taken hold and I am 
haunted by those zipper demons that people on lsd see. Better re-watch 
transformers beast machines. Welp, that's some nice old mixed feelings 
nostalgia&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-orge1654ee" class="outline-2">
<h2 id="orge1654ee">2022-01-09 4:17 am</h2>
<div class="outline-text-2" id="text-orge1654ee">
<p>
Counting this as late night on the 8th. It's been a long day of moving things 
and doing actual work, so I needed a night of not sleep.
</p>
</div>
<div id="outline-container-org8752f13" class="outline-3">
<h3 id="org8752f13">Best thing of yesterday:</h3>
<div class="outline-text-3" id="text-org8752f13">
<p>
getting the carpet. Also working up the courage to take blazer #1 to the dry 
cleaners'. All these have needed to happen.
</p>
</div>
</div>
</div>

<div id="outline-container-org8a407b1" class="outline-2">
<h2 id="org8a407b1">2022-01-09 4:02 pm</h2>
<div class="outline-text-2" id="text-org8a407b1">
<p>
It feels like a lot earlier in the day. I'm three hours shifted. Maybe sleep 
more? John Titor is super interesting. Definitely real. On and unrelated note, 
steins;gate was so good&#x2026;
</p>

<p>
Washing all sheets because bed bugs. Curse them. I'm worried my mattress is a 
spawner. Which would suck. It's a nice and new mattress. Costed $400. I can't 
just toss it now&#x2026; But I can't not. Man these things are the worst. At least 
they're not all over anymore. Hope this queen bed frame turns out okay. It was 
a little sus but should be fine&#x2026; I am using too many <code>...</code> In my writing&#x2026; 
Must stop. Well there's a woman reading in the laundry room and I'm a little 
bit worried. Society ruins any polite conversation that was possible, which was 
basically 0 already. Like, what does we say? You either talk about nothing, or 
plumb the depths of pain. Talking about nothing is painful too. Maybe that is 
the worse pain? The fear of missing out. Well I'm sort of above that. Breaking 
my back just to taking it back to the seventeenth track when none of us were to 
blame&#x2026;..
</p>

<p>
<code>Breaking my back just to know your name</code>
</p>

<p>
<code>But heaven ain't close in a place like this</code>
</p>

<p>
<code>Anything goes but don't blink you might miss</code>
</p>

<p>
I don't miss I hit
</p>

<p>
Hit the target
</p>

<p>
Shame on target. Transgender bathrooms that everyone forgot about. Remember 
when that mattered? I do. And yet life goes on, nobody cares, and we pretend we 
are logical and learn from the past. You gotta hate it.
</p>
</div>
</div>

<div id="outline-container-org52a9276" class="outline-2">
<h2 id="org52a9276">2022-01-09 8:55 pm</h2>
<div class="outline-text-2" id="text-org52a9276">
</div>
<div id="outline-container-orgad244db" class="outline-3">
<h3 id="orgad244db">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgad244db">
<p>
 washing. Also discovering animedl and the constant improvements to Ani-cli. 
Someday I will menu-atize it. So that it works with rofi, wofi, dmenu, fzf, 
anything else. And then make a custom menu script that just selects the one we 
want anyway. Also neovim status line manipulation is weird. I want to make vim 
the default graphical window for everything. Specifically nvim-qt or similar. 
Then this:
</p>

<ul class="org-ul">
<li>standalone window manager with super key prefixed vim motion</li>

<li>independent "bar" on top or bottom that contains vim statusline as seen in</li>
</ul>
<p>
airline or similar, piped into the graphical window somehow
</p>

<ul class="org-ul">
<li>nvim server going in the background</li>

<li>new terminals are nvim-qt clients each with a new term buffer</li>

<li>possibly put some shell alias or function that opens a new edit buffer while</li>
</ul>
<p>
suspending/hiding the current shell/term. Then a ZZ gets one back. Everything 
still feels like it's in the shell, cause it is. But Esc triggers <span class="underline">real</span> vim 
overlay editing rather than a hacky scripted shell vi-mode. \: triggers the 
full Ex command line of vim. The shell is always in vim, and has the properties 
of both vim and itself. This is similar to my previous tmux setup but nvim 
actually has useful features and extensibility whereas tmux is kind of bad.
So far from preliminary testing it appears that we cannot, in fact, "just 
werks" filename completion in the default terminal buffer. I many need to find 
a workaround&#x2026; Also the block cursor is annoying.
</p>
</div>
</div>
</div>

<div id="outline-container-org7b6e43c" class="outline-2">
<h2 id="org7b6e43c">2022-01-10 8:07 am</h2>
<div class="outline-text-2" id="text-org7b6e43c">
<p>
Only one at the office. Fhat a wucking joke. Jon won't answer his text messages 
yet. Guess it's just me! Better check the calendar. In a minute. First I want 
to ~consider this. The hint of the century. Consider this. The slip. You 
brought me to my knees pale. What if all these fantasies come flailing around 
and now I've said too much.~
</p>
</div>
</div>

<div id="outline-container-orga4472f2" class="outline-2">
<h2 id="orga4472f2">2022-01-10 10:32 pm</h2>
<div class="outline-text-2" id="text-orga4472f2">
</div>
<div id="outline-container-orga34769c" class="outline-3">
<h3 id="orga34769c">Best thing:</h3>
<div class="outline-text-3" id="text-orga34769c">
<p>
 took a shower and killed a bug with my bare hands. They can be defeated. Also 
got dad to basically promise to give me a TV. In return I have to show him how 
the apt has progressed. Slightly nervous but whatever. Tired. Night.
</p>
</div>
</div>
</div>
