musings_log.html

<div id="outline-container-org35cf626" class="outline-2">
<h2 id="org35cf626">2022-01-11 5:27 pm</h2>
<div class="outline-text-2" id="text-org35cf626">
</div>
<div id="outline-container-orgaa01330" class="outline-3">
<h3 id="orgaa01330">Best thing:</h3>
<div class="outline-text-3" id="text-orgaa01330">
<p>
set up mtg with mom on Saturday, then going to dad's to pick up the TV. Will 
swing by Carrs on the way back and get some ice cream. In the meantime, 
apparently neovide is working again. Will use that. Night.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc09e47b" class="outline-2">
<h2 id="orgc09e47b">2022-01-11 9:39 pm</h2>
<div class="outline-text-2" id="text-orgc09e47b">
<p>
No bug sightings today. That's almost good. Kind of worried now though. Where 
did they go?
Took another crack at Awesome Window Manager. Not truly awesome. Maybe kinda 
nifty&#x2026; I still don't get lua. I think in bash, config in vimscript, and 
scribble in markdown. The only thing that interests me in Lua is the ambiguous 
parens/braces/quotes. Everything is a lot more verbose and feels boilerplate-y, 
but that's clearly because you're generalizing to a really general syntax. It's 
trying to be minimal and light. It's trying to be Turing complete. It's trying 
to be an effective configuration method. It has to explicitly call the 
program's APIs in the same way that other configfile syntaxes can't. And still 
there are no tutorials on learning these things from a place of only basic os 
scripting. I am confused. These concepts make no sense. There is no type but 
the string, and the pipe is its one true operator! Take me back to TI-basic. 
Maybe I need an IBM 5100. Finally finished reading the logs of John Titor from 
</p>
<ol class="org-ol">
<li>I basically believe him. Those guys who claimed responsibility were</li>
</ol>
<p>
probably just riding the publicity. I don't blame them, except for being awful 
human beings. But whatever. I can't change the past yet, so let them have their 
fun.
Do I stink? Am I lazy? Is my setup jank? Or are we dancer? Haha hahaha so dumb. 
My faith in the Killers is gone after that song. We ain't human after all. Put 
all your blame on me.
</p>

<p>
There is indeed a plugin for neovim to put its statusline in the tmux line. 
This is fine except tmux is bloat. So, I found the tmp file it communicates 
through to pipe it into something else. Guess what, it's in a tmux specific 
format. Tmux has its own config language that is the worst of vim and sh 
combined. Must die. Maybe I can use some lua magic to make a vimlike statusline 
in the Awesome topbar? But the people are retarded. So says big man bigman&#x2026;
</p>

<p>
<code>Down to the wire</code>
</p>

<p>
<code>Fighting'z only begun...</code>
</p>

<p>
No it didn't. I made edits in vim and they did t transfer. Clearly there are 
multi problem. S. Night.
</p>
</div>
</div>

<div id="outline-container-orgd879b0f" class="outline-2">
<h2 id="orgd879b0f">2022-01-12 7:20 am</h2>
<div class="outline-text-2" id="text-orgd879b0f">
<p>
I had a dream. Maybe sort of scp related or something. There was a house with 
some special property and that kept coming up. The events were like youtu.be 
videos. I can't remember the rest.
</p>
</div>
</div>

<div id="outline-container-org95d535c" class="outline-2">
<h2 id="org95d535c">2022-01-12 7:48 pm</h2>
<div class="outline-text-2" id="text-org95d535c">
<p>
Chatting with the GCI rep man on their website. This is $80 per month for 250 
gigs of high-ish speed. Fast enough, certainly. 200m down, 10 up. So bad but 
usable. And not relying on Dad. But also relying on the city. But can hopefully 
get bound to a public IP and thrown on the network. Let's see what they say&#x2026;
</p>

<p>
I'm somewhat skeptical of their chat service. Weird fake message bubbles appear 
and disappear without any content, but then a real one shows up. I'm too fat to 
go to youth night. I'm a dirty old man at the age of 18.
</p>

<p>
The agent was being dumb about IP addresses. He was Indian.
</p>
</div>
</div>

<div id="outline-container-org30a6f28" class="outline-2">
<h2 id="org30a6f28">2022-01-12 10:37 pm</h2>
<div class="outline-text-2" id="text-org30a6f28">
</div>
<div id="outline-container-org74e1f4d" class="outline-3">
<h3 id="org74e1f4d">Best thing:</h3>
<div class="outline-text-3" id="text-org74e1f4d">
<p>
got a hand truck from Lowe's. Will use. Also got GCI set up to give me a 
router. $80 a month. Had trouble with specifics because the poor Indian on the 
phone isn't interested in the subject and wouldn't have access to the info I 
wanted even if he was. Also the illusion of his understanding English was 
shattered as soon as I mentioned IP addresses. But we did the transaction, and 
I got receipts by email so it's probably legit, and I get a free router. The 
worst that happens is nothing works and I cancel the subscription and have a 
random router lying around. But that won't happen unless it does. I must rest. 
Night.
</p>
</div>
</div>
</div>
