org/musings_log.org
* 2022-01-12 11:45 pm
Wall to put mirrors on is roughly 5x8 ft. A couple inches short both ways. 
Lowe's has them. I will go there after Saturday takes place. Till then I walk 
alone...
I cannot sleep I cannot dream tonight
The thought of missing out and not being with my "friends" still bothers me. 
Why is this so? We have nothing in common but some shared memories that are 
ever more remote.
I want them to live without me. I need to branch out. I am told this, I have 
said this. But for what? But the people are retarded. Stallman didn't die for 
this. Jesus didn't rise for this. Anything goes but don't blink you might miss. 
Cause heaven ain't close in a place like this I said a heaven ain't close in a 
place like this.
(what follows is a machine experiment from clicking the middle suggestion):
I think it is a fucking lie to me and I am not sure if I will be able to make 
it to the meeting and the other artist can copy his idea and I will have to do 
it to validate my account and I will have to do it to validate my account and I 
will have to do it to validate my account and I will have to do it to...
(and now, the leftmost suggestion):
Is the only way you do it right away with your default browser to make sure you 
keep your current settings and then you can see that it doesn't work for the 
most recent one that is the dumbest of your computer to be able for a week 
until you have to forward a certain port of your router or the new and actively 
maintained fork of the Linux community and human recovery software is the one 
you need a Mac for the first result in your computer and your reward system for 
your reddit and they will be able for you I'm not sure if I will be able for 
this is to reduce her or not be able for her and I will have a MacBook air 2018 
wifi is not a desktop environment unto the world with a lot less stuff to be 
done than to be able for a week or a week or a day or a day after you leave 
your house or you have a windows or bath tub or bath tub or a modeline that can 
be used for any type or size or space that is needed to make a USB port for the 
sake of the Linux community and human nature to be able for use in a calculator 
form to make sure that you have a windows operating environment and how to use 
for your own home security services or to use the arrow keys on your phone to 
use your distro's address and phone to use your personal name or address and 
phone to your web site to use your personal name or address and phone to your 
web site to use...
(finally, the right side prediction):
The people that are in charge and all of this stuff will help me get the right 
track to go with me on my phone to work in a calculator and then have a MacBook 
for me anymore because of how much money you need a better deal to make money 
with the bugs and updates you have the most best deal for the next two months 
is going well so we have to do with that in our future as a member of your 
business to help out a family with your business partner or partner who is a 
good guy for the most best selling products that are visually attractive to the 
customers who have a good sleep and can help them understand what they don't 
want them in a year ago when we have them on hand with a variety that makes you 
want more comfortable shopping with their products to make your business a 
better quality of life for the most affordable quality you are looking at least 
in the long game we choose from our collection to your favorite products or 
service providers in your home business or family
That last one just ends there. The prediction stops. The button is empty and 
does nothing. I find this curious but rather expected. And reading it back is a 
stupid kind of hilarious.
#+begin_src
1
11
21
1211
111221
312211
13112221
1113213211
31131211131221
13211311123113112211
11131221133112132113212221
3113112221232112111312211312113211
#+end_src
The sums are:
#+begin_src
1
2 prime
3 prime
5 prime
8 2x2x2
10 2x5
13 prime
16 2x2x2x2
23 prime
32 2x2x2x2x2
46 2x23
57 prime
#+end_src

* 2022-01-13 8:00 am
Just had a dream right before I woke up that I found Lillian by accident she 
had pulled into an alternate location of Charlie's bakery that was closed in 
closed down and I pulled in after work I have to her I asked hey are you lil 
she said yeah I think so why and I asked how life was going but instead she she 
asked me this question: "did you know that you can indent text documents.? 
Quote and I said yeah I guess and suddenly the building itself was what is a 
cube and the words were going along the sides of it and suddenly the building 
was clear you could see the forest through the back of it. I kept trying to 
redirect the conversation because I was curious as to how Lillian's life was 
going, but she just he just kept asking me I guess. It's hard to tell what 
happened, since the dream Illusions broken and I could feel my real body waking 
up. As I lay there I kept thinking take me back I want to know what what 
happens I want to ask her how she's doing I want to I want to ignore the Giant 
joint Calamity of the markdown parody. I didn't want this this isn't what I 
wanted no take me back but also okay fine whatever who cares but also know. You 
know? No you don't you don't I want to shine down in the hearts of man I want 
to take it from the back of my broken hats. I'll ask I'm breaking my back. Now 
I shall be late to work because I am dictating this in the car as you can 
probably tell just by reading it. Might edit later but probably won't.

* 2022-01-13 8:09 pm
Best thing: Jon explained me how IP addresses are assigned. Slightly mind 
bending but really rather ingenious. Also, I bought a big thing of milk and 
eggs and used my collapsible dolly for the first time. Not perfect, but 
wonderful. Man, this building 's history is crazy. You gotta wonder, what made 
him do that? Is the place cursed? Hey that's fun. I've always wondered what the 
mental landscape of a horror protagonist would be.
Read an idiotic article from Google recommendations. Basically, isekais are bad 
because SAO already happened and was kind of bad. I want to destroy it in full 
later but can't be bothered to find it. Here's some points they made:
- kirito was boring in his overpoweredness. Thus Rimuru and Ainz are even worse 
because they are more overpowered.
- Shield Hero promotes slavery because Raphtalia is a slave.
- the shows have long names. Long names bad.
- the tropes are tropey. Boring and bad.
- some shows (like re zero) are dark and dark = serious = not-for-everyone = 
bad.
- there are too many. Selection = bad.
- people don't like bad shows that are isekai. This causes controversy. Subject 
of controversy = bad.
- it's not real. Real = good. Non-real = bad.
Yes, I'm simplifying. But that's within sight of the actual thing. Actually, 
here's the link: https://www.cbr.com/harsh-realities-of-isekai-anime/amp/
Faith in humanity lowers just imagining it again.

* 2022-01-14 1:09 pm
Got back in touch with Charles. We're dining tomorrow maybe. Gonna make him 
carry the TV up with me.

