org/musings_log.org
* 2022-01-14 9:56 pm
Good day. Off work early. Tomorrow will happen. Best thing of today: swept 
apartment. Also listened to some hidden Luke Smith rants I hadn't previously 
been aware of so that was good. I need to start recording for YT again... All 
in due time. No router yet, might not be here till Tuesday. Argh. I will have 
to rewrite my website. Probably for the best as it's garbage rn anyway. I 
shouldn't say that. It's fine. Whatever.
Night.

* 2022-01-15 10:59 pm
Long day. Best thing: hanging out with Charlie. Worst thing: nah. The TV 
falling and breaking the stand is kind of bad, but fine. Work-around-able. 
We're leaving together
But still it's farewell
I'm really tired
Good night and oh well.

* 2022-01-16 4:30 pm
Christopher emailed me this morning. Wants me to join some Bible group on 
Saturday mornings and come back to mass. I didn't respond and probably won't.
 Charles Charlie God lies truth noise confusion apparently I'm scrupulous now 
so that's what we're going with I don't know I can't tell everyone else is 
wrong I don't want to be like them but I want to be understood and appreciated 
and loved and known I want to speak and be heard I want to bless them with my 
knowledge and ideas I want to write the dictionary I want to organize I want to 
extend I'm tired. Taida desu. Charles said he'd watch Steins gate, let's see if 
he really does. We might hang out next week. He knows my YT channel. Let's hope 
he doesn't watch the vlogs where i rage at him. Ah well. Then he's a fool it's 
just as well hope it gives you hell.
Should I start trying? Or is this the way of madness? What do you know, haw far 
would you go. You're gonna go far kid... With a thousand lies and a million 
truths ~I'm gonna make it bend and break so say a prayer but let the~ bad times 
roll
~And I want these words to make things right but it's the wrongs that make the 
words come to life, well who does he think he is?~ The worst thing I could say, 
things are better if I stay.

* 2022-01-16 10:44 pm
Best thing: setting up TV? Laundry? I did work a little on tmux and that kind 
of thing. Maybe I should do more on that here. Okay. Night.

* 2022-01-17 8:46 pm
Best thing: merging most of the vim files together. Buying new keyboard.
Ate way too much. I almost want more now. It's either that or jacking off 
again. Checked back in on u/KasaneTeto_. He's doing okay. Seems to have 
mellowed slightly. Someone else expressed the same wistful longing for his 
presence and got accused of Stockholm syndrome. Garbage take. There's more than 
that going on. For one thing, the relationship isn't like that. There's a 
genuine draw to people like that, especially through a textual medium, and 
those who deny it tend to deny it so hard because they feel the pull but reject 
some part of it and take this personally.
What is curiosity? Do I love it, or hate it? Is it good or bad? Bad, 
apparently. I love it. It's sort of an addictive taking of knowledge, a 
hoarding as it were. Even if I have no one to ask, I will observe that I may 
know, and I will grill those around me to find the answers. It is arbitrary. I 
don't want all the answers to everything, just what I'm sort of interested in. 
This is the whole thing with Echidna. She craves knowledge. The mental model. 
The perfect chart of cause and effect. This is the value that Subaru has to 
her. And indeed, the value that Mom had to me was lost when she ran out of 
answers. Charles is ananytical or BS enough that I can keep asking him the same 
question and he will drop more exposition every time. Jon is a river of info 
which I can barely drink from. Subarashii desu. I don't know. Should I know, 
even? They say curiosity caused the Fall. The weighing of uncertainties. The 
first ill-placed bet.
~Great king rat was a dirty old man and a dirty old man was he! Now what did I 
tell you, would you like to see? Oh~
Every story I tell has some fantastical element. It always falls out as a 
battle of wits and morals and ideals with uselessly high stakes and 
based-but-wrong characters. The house can't burn down, or if it does it wasn't 
that bad, but if it was that bad the most interesting character escaped down 
the trapdoor into the cave system of their secret base. The mystery is 
semi-obvious but will be very spun out and contribute very little to the final 
battle. The characters and setting bend over backwards to not stray out of my 
areas of extra knowledge. Pacing is done by intercutting scenes of new 
characters.
I refuse to call my rhymes poetry for that they are not. Poetry should be good. 
Sure, most of the stuff you get in high school is kinda bad or total garbage, 
but there is a goal and a self-respect one must work towards.
Inevitability. Ironic unirony. Subtle and integrated blatant absurdism. 
Ambiguous backstories so I can make up the past as the future stumbles along.
And yet, "oh you're a genius your stories are the best how do you write so 
well" I remember a tiny bit more than you, I treat every missing piece like a 
side quest to be completed by accident, and I push through the self-doubt of 
creating flawed work by propping myself up on your praises. It's not hard. Not 
noble, but not hard. Just a front. A convenient subsystem. Almost emergent.
Vim needs to become like emacs. A complete system where everything can be 
redefined. Write it all in lua, see if I care. Make the viml interpreter a lua 
plugin. Nvim the executable will be but a lua interpreter with base os and 
terminal-control api builtins. The modes will be lua states. Their letters will 
be dictionaries. The ideal statusline plugin will just ask for the name of the 
current mode and put whatever in. It will float and be movable to anywhere and 
bind to anything. The pane/tab/window format will be guttable so we can just 
forward the calls to the desktop to spawn a new gui. No awkward mappings. We 
can define every key as default and redefine any as needed as if from scratch. 
Like qutebrowser. This is my dream.

