org/musings_log.org
* 2022-01-18 10:26 am
Wore the white socks. My feet are throbbing. That whim alone will make this a 
bad day. Maybe. The router is supposed to be delivered, so that should improve 
things slightly. I need to skip lunch. Ate too much yesterday and this morning 
and I want to have Mac n cheese for dinner. How will the website work? Thing 
thing, maybe? Sshfs? Just plonk services on top and hope they mostly work? 
Docker? So many options. Definitely markdown. Definitely an internal network. 
Peertube is a thing. Just forwarding hosted files is also a thing. I want to 
re-encode everything to stream lightly as possible. But keep it on that 
computer. Which will become a sorta desktop. The active laptop will become the 
L13. I reckon the chonktab can stay as a Hotspot. As long as it has an 
ethernet. Pretty sure it does. If not, E585 does everything. That would be sad.
I need to try vm clustering again. Using sshfs. All the things.
Neovide as the terminal has been a good learning experience though. I dig. The 
only problems are cursor-shape and the occasional oof of getting hung up. 
That's mostly my fault for bloating up vim. Which I maintain needs to be 
rewritten entirely in lua. But whatever. Man my feet are throbbing. Not a big 
deal but is annoying.

* 2022-01-18 10:14 pm
Best thing: nah. It was a bad day. I wasted another's money, ate way way way 
too much, didn't get my package-- inexplicably. Eh. Probably a garbage 
underpaid postman. I told Lael so hopefully that will resolve itself tomorrow. 
Generally, everything today was a disappointment. Not happy.
But if I had to pick a best thing, paycheck? No. Capturing bedbug? Not like 
that will lead to anything. Um, watching Cowboy Bebop? Sure. It was good.
I don't feel mad or even really disappointed, just tired. I'll stew in my 
overstuffed thoughts tonight.

* 2022-01-19 7:51 am
Good morning. Whatever that means. I won't go to McDonald's today. I'll try to 
skip lunch. Will go to youth night. Unless router comes? Nah. Not like I would 
know anyway. Need to deposit paycheck anyway.

* 2022-01-19 10:46 pm
Went to youth night. Was chill. Router came to the door so that's all set up. 
TV stand is broken, but I ordered a full good one on Amazon. Spent 50 extra on 
faster shipping since I don't trust their long option. Got double rent in 
Savings because I don't want to fall behind. Will hang out with Charlie Friday 
at 6. He's started Steins gate and is enjoying it. Hooray. Best thing: making 
everything work out. I did the stuff and life delivered. Good night.

* 2022-01-20 8:37 am
Woke up early and semi-dreamt of a chill philosophical wakeup. Then my alarm 
went off. Moved the craptop to underneath the table that now has the TV on top 
of it. This will age super well at the end of the year when everything is 
different. Ej, it's good to remember they say. E585 is connected to the new 
wifi. Now I need to work out my optimal network setup. The idea is that it 
works. Maybe forward different ports to different places? Obligatory mention of 
sshfs for being the best thing ever. Charles says he's got a spare couch. I 
secretly want some sort of portable couch-like thing that is couch-y but 
portable. Not the banana. The banana won't work and I have no idea who thought 
of it. Gabe did. Why? Is he dumb? Nah, he just hasn't actually used one. It's a 
true meme product. Useful for its own thing but not much else. Like most 
things, but it's own thing is less important so it feels more wasted. Ech. So 
much trash. Trasn in my car in my house in my mind. Abcdefu.
And now it's morning. Jon's not here so I'm all alone. Better off all by 
myself... Nah.

* 2022-01-20 10:11 pm
Vim wiki was sorta broken so I switched back to vim-plug to make it work. 
Configuring apache/httpd is going to be sort of tricky. Not too worried, just 
sort of annoyed at the many pitfalls of fixing-up this setup needs. But hey, 
we're aiming for effortless singularly by the end.

* 2022-01-20 10:39 pm
Best thing: learning vimwiki. Great system, actually makes sense. Good night.

* 2022-01-21 8:46 am
/Narrator: 'it was not a good night.'/
I stayed up till 3 am working on ports and ssl and all that madness. As it 
stands my http works, but https does not. Trying ssh now.
Ssh works. Hmm. Should I reboot? I'll reboot. Nah. I won't.
Didn't reboot. Of course not. I'm going to install Debian and put my dotfiles 
on there so this starts working. Setting everything up on artix is ridiculous.

* 2022-01-21 10:33 am
Debian image is downloading. In a tmux pane. Yay! Paru! Apt! This is some 
garbage and I will have to work on that setup script. I really don't want to 
though. It's confusing. In less than 12 hours I will be frolicking with 
Charlie. Where how can I be awake then. With lots of subway. But we're getting 
McDonald's today for lunch. That works out. That's fine.

* 2022-01-22 6:24 pm
Didn't hang out with Charlie last night. He canceled when I was literally at 
the door. Says he was tired. We had a good talk today though. 
Best thing of yesterday: getting all the pieces of the server up and running.
Best thing of today: real talk with Charlie. We watched episode 6 of Steins 
gate and half of episode 7. Right up to the bit where he wins the lottery. I 
think I sort of spoiled Mr Ferdinand Braun, but he's on his toes. Or is 
pretending to be to help my conscience. I told him I was sort of worried that 
he had given up and had 5 girlfriends or something. He doesn't. He's going to 
confession tonight for the first time in like 8 years. Was stressing. Hope he 
works through it.

* 2022-01-23 9:45 pm
Went to mass at st Andrew's. Exactly how I thought it would go.
Best thing: made myself go to mass? Took shower? Also wrote half of the 
web-scraping article. Aight time to laze and sleep.

* 2022-01-24 10:14 pm
Okay day. Best thing: research for Tier 1 of computer iceberg.

