musings_log.html

<div id="outline-container-org5243685" class="outline-2">
<h2 id="org5243685">2022-01-18 10:26 am</h2>
<div class="outline-text-2" id="text-org5243685">
<p>
Wore the white socks. My feet are throbbing. That whim alone will make this a 
bad day. Maybe. The router is supposed to be delivered, so that should improve 
things slightly. I need to skip lunch. Ate too much yesterday and this morning 
and I want to have Mac n cheese for dinner. How will the website work? Thing 
thing, maybe? Sshfs? Just plonk services on top and hope they mostly work? 
Docker? So many options. Definitely markdown. Definitely an internal network. 
Peertube is a thing. Just forwarding hosted files is also a thing. I want to 
re-encode everything to stream lightly as possible. But keep it on that 
computer. Which will become a sorta desktop. The active laptop will become the 
L13. I reckon the chonktab can stay as a Hotspot. As long as it has an 
ethernet. Pretty sure it does. If not, E585 does everything. That would be sad.
</p>

<p>
I need to try vm clustering again. Using sshfs. All the things.
</p>

<p>
Neovide as the terminal has been a good learning experience though. I dig. The 
only problems are cursor-shape and the occasional oof of getting hung up. 
That's mostly my fault for bloating up vim. Which I maintain needs to be 
rewritten entirely in lua. But whatever. Man my feet are throbbing. Not a big 
deal but is annoying.
</p>
</div>
</div>

<div id="outline-container-org543403e" class="outline-2">
<h2 id="org543403e">2022-01-18 10:14 pm</h2>
<div class="outline-text-2" id="text-org543403e">
</div>
<div id="outline-container-org75658e8" class="outline-3">
<h3 id="org75658e8">Best thing:</h3>
<div class="outline-text-3" id="text-org75658e8">
<p>
 nah. It was a bad day. I wasted another's money, ate way way way too much, 
didn't get my package&#x2013; inexplicably. Eh. Probably a garbage underpaid postman. 
I told Lael so hopefully that will resolve itself tomorrow. Generally, 
everything today was a disappointment. Not happy.
</p>

<p>
But if I had to pick a best thing, paycheck? No. Capturing bedbug? Not like 
that will lead to anything. Um, watching Cowboy Bebop? Sure. It was good.
</p>

<p>
I don't feel mad or even really disappointed, just tired. I'll stew in my 
overstuffed thoughts tonight.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5757d1" class="outline-2">
<h2 id="orgd5757d1">2022-01-19 7:51 am</h2>
<div class="outline-text-2" id="text-orgd5757d1">
<p>
Good morning. Whatever that means. I won't go to McDonald's today. I'll try to 
skip lunch. Will go to youth night. Unless router comes? Nah. Not like I would 
know anyway. Need to deposit paycheck anyway.
</p>
</div>
</div>

<div id="outline-container-orga439d90" class="outline-2">
<h2 id="orga439d90">2022-01-19 10:46 pm</h2>
<div class="outline-text-2" id="text-orga439d90">
<p>
Went to youth night. Was chill. Router came to the door so that's all set up. 
TV stand is broken, but I ordered a full good one on Amazon. Spent 50 extra on 
faster shipping since I don't trust their long option. Got double rent in 
Savings because I don't want to fall behind. Will hang out with Charlie Friday 
at 6. He's started Steins gate and is enjoying it. Hooray. 
</p>
</div>
<div id="outline-container-orgbadf79b" class="outline-3">
<h3 id="orgbadf79b">Best thing:</h3>
<div class="outline-text-3" id="text-orgbadf79b">
<p>
making everything work out. I did the stuff and life delivered. Good night.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb64184f" class="outline-2">
<h2 id="orgb64184f">2022-01-20 8:37 am</h2>
<div class="outline-text-2" id="text-orgb64184f">
<p>
Woke up early and semi-dreamt of a chill philosophical wakeup. Then my alarm 
went off. Moved the craptop to underneath the table that now has the TV on top 
of it. This will age super well at the end of the year when everything is 
different. Ej, it's good to remember they say. E585 is connected to the new 
wifi. Now I need to work out my optimal network setup. The idea is that it 
works. Maybe forward different ports to different places? Obligatory mention of 
sshfs for being the best thing ever. Charles says he's got a spare couch. I 
secretly want some sort of portable couch-like thing that is couch-y but 
portable. Not the banana. The banana won't work and I have no idea who thought 
of it. Gabe did. Why? Is he dumb? Nah, he just hasn't actually used one. It's a 
true meme product. Useful for its own thing but not much else. Like most 
things, but it's own thing is less important so it feels more wasted. Ech. So 
much trash. Trasn in my car in my house in my mind. Abcdefu.
</p>

<p>
And now it's morning. Jon's not here so I'm all alone. Better off all by 
myself&#x2026; Nah.
</p>
</div>
</div>

<div id="outline-container-org33f65b8" class="outline-2">
<h2 id="org33f65b8">2022-01-20 10:11 pm</h2>
<div class="outline-text-2" id="text-org33f65b8">
<p>
Vim wiki was sorta broken so I switched back to vim-plug to make it work. 
Configuring apache/httpd is going to be sort of tricky. Not too worried, just 
sort of annoyed at the many pitfalls of fixing-up this setup needs. But hey, 
we're aiming for effortless singularly by the end.
</p>
</div>
</div>

<div id="outline-container-org5b0d88d" class="outline-2">
<h2 id="org5b0d88d">2022-01-20 10:39 pm</h2>
<div class="outline-text-2" id="text-org5b0d88d">
</div>
<div id="outline-container-org7c3e9b6" class="outline-3">
<h3 id="org7c3e9b6">Best thing:</h3>
<div class="outline-text-3" id="text-org7c3e9b6">
<p>
learning vimwiki. Great system, actually makes sense. Good night.
</p>
</div>
</div>
</div>

<div id="outline-container-org7ac4ebd" class="outline-2">
<h2 id="org7ac4ebd">2022-01-21 8:46 am</h2>
<div class="outline-text-2" id="text-org7ac4ebd">
<p>
<i>Narrator: 'it was not a good night.'</i>
I stayed up till 3 am working on ports and ssl and all that madness. As it 
stands my http works, but https does not. Trying ssh now.
</p>

<p>
Ssh works. Hmm. Should I reboot? I'll reboot. Nah. I won't.
</p>

<p>
Didn't reboot. Of course not. I'm going to install Debian and put my dotfiles 
on there so this starts working. Setting everything up on artix is ridiculous.
</p>
</div>
</div>

<div id="outline-container-orgc60dd56" class="outline-2">
<h2 id="orgc60dd56">2022-01-21 10:33 am</h2>
<div class="outline-text-2" id="text-orgc60dd56">
<p>
Debian image is downloading. In a tmux pane. Yay! Paru! Apt! This is some 
garbage and I will have to work on that setup script. I really don't want to 
though. It's confusing. In less than 12 hours I will be frolicking with 
Charlie. Where how can I be awake then. With lots of subway. But we're getting 
McDonald's today for lunch. That works out. That's fine.
</p>
</div>
</div>

<div id="outline-container-org42d41a9" class="outline-2">
<h2 id="org42d41a9">2022-01-22 6:24 pm</h2>
<div class="outline-text-2" id="text-org42d41a9">
<p>
Didn't hang out with Charlie last night. He canceled when I was literally at 
the door. Says he was tired. We had a good talk today though. 
</p>
</div>
<div id="outline-container-orga0568e8" class="outline-3">
<h3 id="orga0568e8">Best thing of yesterday:</h3>
<div class="outline-text-3" id="text-orga0568e8">
<p>
getting all the pieces of the server up and running.
</p>
</div>
</div>

<div id="outline-container-orgd33859c" class="outline-3">
<h3 id="orgd33859c">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgd33859c">
<p>
 real talk with Charlie. We watched episode 6 of Steins gate and half of 
episode 7. Right up to the bit where he wins the lottery. I think I sort of 
spoiled Mr Ferdinand Braun, but he's on his toes. Or is pretending to be to 
help my conscience. I told him I was sort of worried that he had given up and 
had 5 girlfriends or something. He doesn't. He's going to confession tonight 
for the first time in like 8 years. Was stressing. Hope he works through it.
</p>
</div>
</div>
</div>

<div id="outline-container-org25b0c84" class="outline-2">
<h2 id="org25b0c84">2022-01-23 9:45 pm</h2>
<div class="outline-text-2" id="text-org25b0c84">
<p>
Went to mass at st Andrew's. Exactly how I thought it would go.
</p>
</div>

<div id="outline-container-org0f484de" class="outline-3">
<h3 id="org0f484de">Best thing:</h3>
<div class="outline-text-3" id="text-org0f484de">
<p>
 made myself go to mass? Took shower? Also wrote half of the web-scraping 
article. Aight time to laze and sleep.
</p>
</div>
</div>
</div>

<div id="outline-container-orgefbf5fe" class="outline-2">
<h2 id="orgefbf5fe">2022-01-24 10:14 pm</h2>
<div class="outline-text-2" id="text-orgefbf5fe">
<p>
Okay day.
</p>
</div>
<div id="outline-container-org1ab6539" class="outline-3">
<h3 id="org1ab6539">Best thing:</h3>
<div class="outline-text-3" id="text-org1ab6539">
<p>
research for Tier 1 of computer iceberg.
</p>
</div>
</div>
</div>
