musings_log.html

<div id="outline-container-orgc8adc4a" class="outline-2">
<h2 id="orgc8adc4a">2022-01-25 7:11 am</h2>
<div class="outline-text-2" id="text-orgc8adc4a">
<p>
2 dreams last night:
</p>

<ol class="org-ol">
<li>I went back in time in Anchorage. A hundred years but also a thousand or</li>
</ol>
<p>
something. An ancestor of Charles was there and so was Elon Musk who had 
invented cars way too early. I told him, won't this mess up the time line, he 
said nah, it will but who cares. There were 2 instances. 3 jumps. I used a lot 
of mobile data in the first one. Talking to Charlie. I noticed discrepancies, 
talked to people, and worked around them. I got booted off and had to return 
but it wasn't a big deal. The third jump I was Lillian. I went to the women's 
bathroom and it was melty like Styrofoam and had negative gravity. I was naked 
but there was a large pile of towels. Someone came in and I had to hide myself. 
I behaved as if everything were as I expected and got chased away like any 
other isekai. It somehow didn't feel like I was lacking critical information, 
or even doing anything stupid. The setting of this all was a 2 storey motel B&amp;B 
where the welcome to Anchorage sign is now. It was orange like Arizona or Mars 
but more yellow and not particularly temperature.
</p>

<ol class="org-ol">
<li>The loner badass OP protagonist is in an isekai with several girls. One of</li>
</ol>
<p>
them has a move where she jumps high up and hits the monster really hard with 
something in her left hand, and quickly tucks her short-short-skirt back down 
with a smirk. For some reason there was tension between her and protag-kun. So 
he is training her or something. Doesn't want her body. Is the assumption. So 
she twists everything into a hyper sexualized position and he just kind of 
ignores her. Until one day he decides to punish her. What punishment? I don't 
know. I disconnected from him and started waking up. Probably something cruel 
and pointless. Like cult leader crazy. Like that moment in the music video for 
you're gonna go far kid where leaf lady goes yuck. That's how it felt. He 
abandoned all relatability.
</p>
</div>
</div>

<div id="outline-container-org79c473e" class="outline-2">
<h2 id="org79c473e">2022-01-25 8:25 pm</h2>
<div class="outline-text-2" id="text-org79c473e">
<p>
They sprayed my baseboards again. Good. Let the bugs die. I found some 
carcasses.
</p>

<p>
Still haven't shipped my TV stand. Charles can't bring the couch till Saturday 
maybe so that's a minor bummer. Bought pj pants and underwear and more cheeto 
Mac&amp;cheese. Ate some already, now I'm very full. Jreg is so post-based. It's 
too hot under here. They're thick pj pants. 
</p>
</div>
<div id="outline-container-org31ff67c" class="outline-3">
<h3 id="org31ff67c">Best thing:</h3>
<div class="outline-text-3" id="text-org31ff67c">
<p>
worked more on iceberg.
</p>
</div>
</div>
</div>

<div id="outline-container-org994f992" class="outline-2">
<h2 id="org994f992">2022-01-26 10:48 pm</h2>
<div class="outline-text-2" id="text-org994f992">
</div>
<div id="outline-container-org91bc1ca" class="outline-3">
<h3 id="org91bc1ca">Best thing:</h3>
<div class="outline-text-3" id="text-org91bc1ca">
<p>
youth night and got Mikael tentative for next Friday. The one in 9 days. We'll 
see what a godless nation we have become. I'm thoroughly tired but want to 
chill awakely for a bit. Might not be wise considering the morning to come. 
Josh says he'll be in 8:00. (X) doubt. Not working on website or iceberg today. 
Gnight. Worst thing: YouTube comment arg on old back to the future pitch 
meeting. These people are difficult to discourse with and I shouldn't bother.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfd9e8fb" class="outline-2">
<h2 id="orgfd9e8fb">2022-01-27 8:55 am</h2>
<div class="outline-text-2" id="text-orgfd9e8fb">
<p>
I guess I'm happy. Well worn out from last night, and Josh is awake but not 
here. Basically it's a perfect day in the morning. Gene and Jon should be here 
around 11 or 12. Josh says he's showing up but I doubt that too. I should stop. 
He seems okay today. Whatever. Not my life. Maybe it will be&#x2026;
</p>

<p>
He just wanted the calendar. That's fine. Sent to him. We good, we good. 
Seriously need a vim keyboard for Android. And neovim to be rewritten in lua. 
Let me do some research&#x2026;
</p>
</div>
</div>

<div id="outline-container-org86e694f" class="outline-2">
<h2 id="org86e694f">2022-01-27 10:36 pm</h2>
<div class="outline-text-2" id="text-org86e694f">
<p>
Not a very good day. Work got miserable when Jon showed up. I love la Cabana 
but hate how their food makes me feel at work afterwards. So heavy and slow.
</p>

<p>
The search for a truly extensible editor has led me through some rabbit holes 
regarding the nature of line breaks in files, and some alt-plan9 forays into 
array-based text editing. And ultimately back to emacs. I'm giving it a try 
again, this time with System Crafters' tutorial. Might be good, might not. Who 
knows. At worst it's scriptable notepad, at best it's the best thing ever. I 
just hope we can fix the fakeness of the GUI before it gets any more 
entrenched. They say everything in Emacs is re-definable so it better be. At 
worst we tear it all down and disable all splits and forward it to the OS.
</p>
</div>
</div>

<div id="outline-container-org66e9603" class="outline-2">
<h2 id="org66e9603">2022-01-30 1:51 am</h2>
<div class="outline-text-2" id="text-org66e9603">
<p>
Whew. What a weekend maybe I guess.
</p>
</div>
<div id="outline-container-orgb8404a9" class="outline-3">
<h3 id="orgb8404a9">Best thing of 1/28:</h3>
<div class="outline-text-3" id="text-orgb8404a9">
<p>
Josh came in and got that client some help. The one that hates their previous 
lawyer and can't get a job because background checking is unconstitutionally 
broken.
</p>
</div>
</div>

<div id="outline-container-org4a0aed2" class="outline-3">
<h3 id="org4a0aed2">Best thing of 1/29:</h3>
<div class="outline-text-3" id="text-org4a0aed2">
<p>
 bought a homeless woman some Wendy's. It was awkward, but it felt good. Kind 
of. Also put mirrors up finally. Need to go to Lowe's tomorrow to get more.
</p>
</div>
</div>
</div>
