musings_log.html

<div id="outline-container-orge1e26eb" class="outline-2">
<h2 id="orge1e26eb">2022-01-30 8:50 pm</h2>
<div class="outline-text-2" id="text-orge1e26eb">
<p>
Mirrors fell down in the night. Spent all day cleaning the glass up. Sucks.
</p>

<p>
Finished CowboyBebop. Good. Watched the incomplete second season of 86. Okay. 
Ngl the whole gritty-war-battle isn't really my thing, and a lot of what I 
enjoyed from the first season was missing. It's a good continuation, but in my 
book 86 ended after the original run.
</p>

<p>
Worst thing: having to clean up all that glass. Generally a rather rotten day. 
Ate a double batch of cheeto mac. Ranted straight onto my website about it too. 
<a href="./articles/idkman.html">./articles/idkman.html</a>. Had a crazy dream last night but whatever. Not 
really ready for tomorrow. Jon will be cranky and resigned, Josh will be in a 
convenient coma, gene will be crazy, and I will be heavy and irritable. Much 
water will be drank leading to heavy peeing in the afternoon. I will reject la 
Cabana when it comes down to it because I can't work afterwards. Good place 
just not time for it. Eating there consumes the whole day. I'm so fat. God I'm 
so fat. This healthy gamer doctor k guy seems chill and smart. Some of those 
patients are a lot like me but different in respectable ways. Finally someone 
else who can be allowed to exist in the new order. If that's what a therapist 
is like, then I want one. But I've heard bad stories, and I've made them up. I 
have a theory about manipulation and the human condition that ties into this as 
well as Charles and everything else.
</p>
</div>

<div id="outline-container-org5f411ff" class="outline-3">
<h3 id="org5f411ff">Best thing:</h3>
<div class="outline-text-3" id="text-org5f411ff">
<p>
 letting random lesbian in just now. She dialed the wrong door code. I answered 
and she hung up. I went down anyway to check. Her gf apparently locked her out. 
I believed her and let her in and rode partially up the elevator. She's in 109. 
Hope that worked out.
</p>

<p>
Yesterday with the homeless girl. I could have gotten her to have sex in 
exchange for a meal or money. Why didn't I? 1. She smells like cigarettes. 2. I 
was nervous and didn't know how to chat with someone like that. 3. I'm out of 
shape and want to save the first time. Do I? Do I actually care? I swear it was 
like an anime. Never came up. I thought the real world was darker and grittier. 
She wanted to eat inside. I think I creeped her out but she was too desperate 
for food. Would have liked to have an actual convo with her but again. Awkward. 
I felt really guilty for already being full. Still bought a ton of food after 
though. Like I have no shame internally. I guess I should have gotten her 
number or something. I saved her from that security guard. He was a Huell type. 
Would have dragged her away and apologized for the inconvenience.
</p>

<p>
Gonna make a list of anime to watch next so I'm not blindsided. New note, 
creating now.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd80e038" class="outline-2">
<h2 id="orgd80e038">1-30-2022 10:40 pm</h2>
<div class="outline-text-2" id="text-orgd80e038">
<p>
Here's a pill to rival the bog-pill: the beggin-pill. It is this:
</p>

<p>
The song "beggin" has existed for the entirety of humanity's history. It was 
sung by cavemen whose cave-women left them, and has been passed down the 
generations as an artifact of culture. Everyone has heard some version at some 
point in their life. In recent memory we can pinpoint specific instances of its 
evolution due to digital recording technology, but none of these groups wrote 
it. No one wrote it. It is the perfect encapsulation of masculine regret, and 
is a universal constant. It will continue to exist as long as its protagonist, 
that is to say, forever and different in the minds of each whom it touches.
</p>
</div>
</div>

<div id="outline-container-org6d71cca" class="outline-2">
<h2 id="org6d71cca">1-31-2022 10:38 pm</h2>
<div class="outline-text-2" id="text-org6d71cca">
<p>
I was led on down a rabbit hole. Now I must plumb it, the depths of it all. I 
began to watch Redo of Healer. By all accounts a mess, a vile mess, a highly 
dark and sexual work. The kind where you don't think the author could possibly 
write a wholesome or compelling story afterwards.
</p>

<p>
Only 4 or 5 episodes in, but here's my intermediate verdict:
</p>

<p>
The Healer is halfway between me and a cult leader. I know which one I'm 
referring to. I sort of grasp how he became as desperate as he is, and I long 
for that revenge right there with him. But the sexual aspect perplexes me. It's 
sort of like the rest: an aspect. Yet he gaslights too, especially about that. 
Extremely manipulative. In a very stereotypical way. But very dangerous. If I 
shared a universe with him I would need to kill him. But then he'd just rewind 
time and ass-rape me. And make me his bitch boy slave pig. Which I guess would 
be fine. At least, he'd make me believe it was for the best.
</p>

<p>
This honestly feels like a darker version of Shield Hero. The parallels are 
obvious so I won't state them here. Ack now my brain is trying to 
alternate-history-novel a Redo of Shield Hero. I am disgusted. Looking for an 
excuse to say "taida desu ne" but can't find one. Truly slothful!
Healer-monster wants sex. He craves it, to him it means power. Which makes 
sense. He isn't coming from a vaguely post-Christian internet-age setting, he's 
a fantasy character with roots and a kinda mom and an understanding of the 
magic system. Great excuse to not explain things BTW author-San, if you ever 
read this. You won't. Because I have no redo. I can (not) redo. No sign but 
Jonah.
</p>

<p>
Anyway.
</p>
</div>

<div id="outline-container-org8cd040a" class="outline-3">
<h3 id="org8cd040a">Best thing of today:</h3>
<div class="outline-text-3" id="text-org8cd040a">
<p>
work went well. Deposited checks for Josh and returned just in time to leave. 
Jon apparently had a headache, but it's fine. Tomorrow is la Cabana. I have to 
not eat tonight or in the morning. Nothing until lunch, and nothing after. It's 
way too much anyway. Already. I am tired. Satisfied? No clue. What a terrible 
phrase. In preschool there was a kid who said no clue all the time. He was 
tall(er than me). I hit him with a death snowball once and he didn't quite die. 
But now I have an aversion to snowball fighting. Hope he's okay ish. Hope he 
got a clue.
Night.
</p>
</div>
</div>
</div>
