org/musings_log.org
* 2022-02-01 9:51 pm
Finished redo of healer. Wow, wow wow wow wow. Terrible. The sum of all 
depravity. Needs another season.
His revenge isn't ordered, or logical, or even really fitting. Well, maybe it 
is, but that would almost have to be a retcon at this point.
What is sex to the Healer? A method of control, of torment. A reward, a bond, 
an indulgence, a power source, a workout. A whim. A gloat. The indirect object 
(Latin Dative case) of gaslighting. The adverb of payback. The subject of any 
sentence with a simple "is" clause. It's basically everything. Anything. 
In this sense Redo is like all porn/hentai/etc-- the sex is an authorial 
indulgence, contrived into the plot. And yet, it is also a real and potent 
tale. The sex isn't just a punchline or collapse-state, it has real causes and 
real effects. The people participating are real and fleshed-out and have lives 
that led here and will be affected by this. The demon princess masturbates 
because of her shame and hopeless-heir-in-hiding complex, combined with pent-up 
confusion. Healer has a threesome in front of her because he wants to shock her 
and loosen her up and get everything on the table. He doesn't go for her 
because he sees her as an ally and not a pet or slave. She did nothing and cost 
him nothing, so exerting his _ore_ would be... What? What standard does the man 
have? Something of an aesthetic class. Useless and un-fitting.
Is this a deconstruction? The negation through over-concentration of 
whatever-excuse-for sex? I don't think so. It's a lot like what it looks like. 
Power fantasy revenge rape harem. That is its genre, its mood, its essence. And 
yet it does this archetypically. As if nothing else yet has or will. The 
contrivance is precisely on the border. Interspecies reviewers was firmly on 
the outside-- a totally contrived plot, a transparent excuse to be generically 
lewd without saying much of anything about the framing device. The sort of weak 
repetitive almost-porn you can sit there for hours with, pinching the shriveled 
sheath of your manhood and slapping your thigh without thinking much of it.
We'll have to wait for it to finish, but end of world harem looks to be the 
opposite extreme. A simple and plausible contrivance, and the inevitable 
necessity it brings. Like, it would definitely happen.
Reviewers can't happen because of real life. End of world harem has to happen 
because of human nature. But Redo is different. It is character driven. It is a 
sharp rebuke of the kind of people that Healer hates, that we hate. It is a 
tacit but nuanced agreement with its protagonist. It is a fractal. He gaslights 
the girls and he gaslights us by showing that. By the end, I was with him. What 
does that say about me? Are we really that different?
Best thing of today: signing up for Extra. Credit score thingy-izer. Oddly 
enough, the sponsor on a Zach Star sketch about watching xxx for the plot.
I need some sign that there can be a better future. This rabbit hole is a 
vantablack rug and I stubbed my toe on it.

* 2022-02-02 7:30 am
Last night I dreamt that I was a replacement actor for Shinji in an extremely 
high budget Evangelion live-action movie. The other actors had been studying 
and practicing much longer than I had, and seemed to fit their roles better. 
They kept assuring me that I'd be fine, to just be who I thought Shinji was on 
set. I wasn't familiar with the set or props or other actors, it was awful. The 
others never broke character. So I didn't either. I channeled that nervousness 
into a shinji like grim pragmatic wimpiness. Thus acting out of character by 
getting in the robot, I guess. That didn't occur to me then. Huh.

* 2022-02-02 10:45 pm
Best thing: real talk with Charlie. Discussed religion, basedness, and the 
Healer. He is hopeful but still believes that only Catholic/Orthodox is right 
and accounts for everything. Does not understand / accept my "understand every 
sin and sinner" mentality. Not sure I do either.
But I want to understand. I want to emphasize. I think I understand Hitler 
already, maybe Stalin too. From what I know of their histories it seems to make 
sense.

* 2022-02-03 11:10 pm
Finally doing the emacs theme right. This could be good.
Tiring myself out with heavy work and light anime. This could be heaven and 
this could be hell.
Best thing of today: sitting down after the whole move-all-change-of-pleas 
affair. It felt so good and relaxing.
Man I really want that couch. Charles...

* 2022-02-04 10:58 pm
Emacs is going well. I may switch pretty soon. The canned org-html copypasta 
seems somewhat broken, but individual file export works fine. Tomorrow I may 
try magit. And then? A fully literate config? It would be good to go document 
everything and trim out the unnecessary bits. The built-in terminals of Emacs 
are fairly disappointing. Barely even 256color, curses apps are broken, 
cursor-shape is overridden by emacs itself, pasting is hacky, and their names 
and distinctions are pretty confusing. I mean, we all know the best terminal is 
an actual terminal, but what we have is 1.75 single-line ptys with broken 
scrollback, a semi-okay 8color shell host, and a re-implementation of the 
coreutils with an annoyingly different syntax. Only eshell (the last one) shows 
any promise for the fabled intellisense pop-up command/argument completion, but 
that has so many other issues already that it leaves me very confused. Also 
it's still basically just a line editor with visible history. Forget about 
ncurses. Agh. Sorry not sorry for the rant. This is a pointless setback. I will 
have to write my own emacs shell-host from scratch once I comprehend lisp. It 
sort of makes sense, just not from both directions. I can read but not compose. 
Still thinking in shell.
Charles should be getting that couch over here tomorrow, and Dad might show up 
or want to eat somewhere. It'll be a day.
Best thing: finding/installing yascroll, the emacs text scrollbar. That gui one 
is dumb and broken.
Wow I'm useless. Did nothing today and won't be tired yet.
Good night.

