org/musings_log.org
* 2022-02-06 1:17 am
This counts as last night because I'm still awake from that day.
There is hope for emacs. Nvim will take decades to catch up at this rate. 
Especially since evil-mode already exists.
Best thing: watching the Iruma-kun arc where he turns evil. There's just 
something about how it was built up from the first season finale, and he's 
keeping all the connections he made as a hapless pushover, and he actually 
takes advantage of it all. It wouldn't have worked if he'd been like that from 
the beginning and pretending. Interesting. I guess that happens to me too, just 
on a smaller scale and it's always too late in the day to be of use. I'm 
strongest and smartest when it's mostly dark and I'm on the second can of dew. 
The most I've done for my tomodachis was at that point, the most daring 
adventures, the tallest bluffs. I stop third-guessing myself and use all of my 
mind. And yet, taking in new info is harder, and any bodily function wrecks the 
flow way more than usual.
Met with dad today. He's been doing a lot for work etc. Says I should Def do my 
taxes. Bought me groceries and lunch.
Still no TV from Charlie. I texted him about it saying it's okay, but I wrote 
"daijobu desu" instead. Ultra cringe. Whoops. Whatever. Daijobu desu.
I have a minor ache in the left side of my head, I feel heavy, and my eyes are 
a little dry. Shikashi, I am fine. Perfectly single-minded.
But tired. Still, it's been too much dew today (6 cans total?) so I couldn't 
sleep if I tried. May as well write.
#+begin_src
<song name="father to son" artist="Queen" >
Take this letter that I give you
Take it sonny hold it high
You won't understand a word that's in it
But you'll write it all again before you die.
<solo/>
</song>
#+begin_src
Man, html is nasty. Really got to switch to Org Mode.

* 2022-02-06 9:29 pm
Time is crazy. I am sorta tired. Today was mostly pointless. Watched a bunch of 
Emacs videos. Began the Great README.org Migration Project with my zshrc. 
There's still so much to unravel from this ecosystem, and get used to. It's not 
vim, even if it does an excellent job pretending to be.
Best thing: took out trash. Worst thing: this anime is so slow and light and 
silly. Admittedly, its jokes all hit and it's a good watch, it's just not 
really the mood I'm in. Hey, Charlie responded and didn't seem disdainful, just 
tired. He probably still has a life. Hmm. Guess I do too. Today is the day that 
is a day. Meaning nothing, signifying dessication. An idle and fruitless 
masturbation. Clouds in the shape of arrows, pointing at the omnidirectional 
horizon of forgetful blasphemy. Shakable unshakable glowing glowering showers 
from towers of the powers' prestige. This is writ ironical. Watching Redo of 
Healer has changed me and not for the better, maybe. A grim reminder that 
Shield Hero was a great show and true porn has no production value. There's an 
isekai parody on hanime and it's literally a sideshow. No flow or story or even 
a voice for the MC. I'm almost certain that all the girls are voiced by one 
person. Not because of how they sound-- they don't sound like anyone or 
anything really-- but that would fit the theme.
Okay, I'll just say it. It's been too long and otherwise it'll never get said.
In video-form pornography of all kinds, the sex is the only thing that matters. 
All that should be (though should itself is problematic in such a context) 
necessary is the sex itself. That is the essence of the genre, and the closest 
thing it has to a societal role. But oreitachi cannot live without some sort of 
plot, nor some petty disregard for the constructs of society, so plots are 
devised to frame and justify and contextualize the sex. And these are 
intrinsically lazy and nonsensical and repetitive and pointless-- for they all 
converge in the same place. The sex. Which itself is also nonsensical and 
repetitive. And so we have a curious phenomenon emerge: the plot means nothing 
apart from the sex, and the sex means nothing apart from the plot. In this and 
no other genre, the ending is completely and intrinsically inevitable. Showing 
and fully indulging in its defining plot point brings the story to a complete 
halt, and in many cases all consistency is lost now that the sexual portion has 
begun. From this point the only things that can happen are minor interruptions, 
new fuckers joining in, random cuts to a change in position, or The End. Which 
itself is only slightly less inevitable: there are now 2 possibilities. 1. The 
cum ending. 2. The shame ending. If there is a sequel, it will doubtless be a 
repetition of the original, for a straight continuation would have no plot left 
to cling to.
But this is the sinister bit: sex as a plot device can mean anything, nothing, 
everything, all at once. Maybe it's an indulgence. Maybe it's a rite of 
passage. Maybe it's a punishment. Maybe it's an accident that they just go 
along with. Whatever. It's the answer to wherever the plot's conflict happens 
to be when they calculate that the viewer is beginning to lose interest. So the 
plot has to be simple or inevitable enough to at least somewhat justify the 
singular waveform collapse. Just as Marvel has its sky-beam or Star Wars its 
spherical planet destroying laser or isekai has its demon king.
I don't feel like thinking about this anymore. Taida desu ne. Oyasumi!

* 2022-02-07 10:02 pm
Tired. Stressed. Too much or not enough, constantly bouncing between. What even 
be?
Best thing: made omelet for real for the first time in the new apt. Got 
paycheck. Didn't go buy ice cream even though I was all the way out in Eagle 
River. Ah well. I'm going back on Saturday to help mom move. That will be a 
struggle.

* 2022-02-08 10:14 pm
I'm okay. I'm not okay. Well, mostly okay. Emacs continues to exist. That's 
fine. Did a few things today and they all worked except editing over ssh, which 
is a problem with the underlying OS and not a big deal. Best thing: accurately 
described Josh's color pallette and explained why he should have worn a white 
shirt. He wore blue on blue with a green tie. To Federal Court. Ah well. At 
least he did something today.
Emacsclient -c is what I want. It launches a new "frame" which is a graphical 
window on which are drawn... Let's just do a stack hierarchy.
Linux Framebuffer 
Wayland compositor
Xwayland - Wayland client, x server
X client window: emacs frame
Emacs windows - may-or-may-not be made out of text
Emacs buffers - just like vim buffers. The editor's localized copy of the file, 
rendered as mostly-text with some inline images or pitch variation. The former 
is janky and needs work, while the latter is perfectly implemented. Except for 
window sizes with variable width fonts in the terminal! That's right, they 
really did just go "hey let's communicate everything as text and when we get 
thinner text just put more spaces in so it kinda lines up and fix it in the 
toolkit". Come on.

