org/musings_log.org
* 2022-02-09 7:16 am
Just woke up. Dreamt of the Disaster Leg: a copypasta and human benchmark. 
Associated with the new year and a lot of other things too. In the dream I 
drove to HRA's new location in the Jitters mall in Eagle River and read the 
outdoor signs. I did the homework from those. I entered the entryway which was 
Carr's and Morris and Murray cornered me. I said, hi I'm back and they said, 
you're going to need to do a lot of catching up. I said, I did the homework. 
Turns out they hadn't updated those signs in over a year. Huh. I went to Jon 
and he gave me a page written in Courier New and said "write this in one page 
for a bonus". So I scanned it as a pdf, copied the text, did some formatting so 
it all fit on one side, and gave it to him the next day. That was the opposite 
of what he meant. So I had to hand-write it in a hurry during a crafts session. 
We had fine tip kiddy markers and one of them looked white but turned out to be 
cyan, and then everything white looked cyan in the dream for a while. Anyway, I 
wrote it out on a thingy, and he read it and was surprised but said it was 
alright. The text itself was about the guy and the demon lord who was a white 
dragon snake with the head of a catfish. The third-tier giant evil dragon said 
to his master from the shore 'I don't think he's here: the humans have so many 
apparatuses set up in this lake etc' and his boss didn't believe at first but 
then did. Immediately the maou came up out of the water and there was a battle 
between him and the dragon. A human who had clear yellow skin and no genitalia 
walked along the floor of the lake. Something happened and they lost their leg 
in the disaster but everything else was fixed. So goes the tale of the Disaster 
Leg.
I'm missing something. That was weird. Why did I remember? Oh well. Might tell 
Charlie if he shows up tonight. If I show up tonight.

* 2022-02-09 10:41 pm
Went to youth night. Got pretty tired because dodging. Context is fleeting. 
Whatever.
I asked Gabe for the forms to be an adult helper since I'm old now. He said 
okay go to the website do the things sign the form drop it off. I need to tell 
him to have someone be there to do that because I work till 5. I should not 
have mentioned that I dreamt I went back to HRA. He responded with, "that's 
creepy" or something similar. Don't remember the exact wording but it was 
extremely offensive in an offhand way. Now I'm scared to do the stuff and mad 
at him for saying that and ashamed at continuing to go and worried about not 
coming back. I don't know what to do. Should I switch to Esto Vir or something? 
Should I go to Christopher's Saturday thing? I'd have to go to mass too then. I 
need to vent at Mom. That's my one real worry now. But she keeps eluding my 
grasp. With small talk and power plays and oblivion. It's all in my head 
because there's nothing in hers.
What mortal sins am I committing? Besides the main one. Somewhere in here is a 
way out. All tangled up in scheduling and connections and patterns of thought. 
I hate that. Why can't I just be a brain in a jar. Stop having to translate 
everything all around into the trivial all the time. Just because I can parse 
any English expression doesn't mean it's enjoyable, or should be necessary. I 
hate it. I hate knowing the most. I hate not getting to flex that knowledge. I 
hate the suspicion that we're not understanding the same way in a conversation.
Wow. What a Regulus Corneas rant. And I like him will die an immortal virgin. 
Virgin is such a weird concept. It's desirable but embarrassing. A physical 
distinction with social exceptions.
I'm falling asleep just trying to come up with words so bye.

* 2022-02-10 9:41 pm
I have nothing to put here. I have saturated myself with information and 
experience today, but I am satisfied. Nothing is right but nothing is wrong. 
Everything is redefined lisp expressions anyway. Everybody's are stacked 
different.
Best thing of today: that Graham cracker in the morning. With the water. Peak 
snack right there. Refreshing, slow, and sets a natural limit on itself.
I tried out EXWM today. Needs more configging. Has promise, especially with the 
next version of Emacs going pure GTK. Maybe we can throw a Wayland compositor 
on there soon? With wlroots. I genuinely have hope. I mean, it's already got a 
window manager, an init (sort of), an editor, a browser, a shell, and lots of 
games. If we get a good Wayland module it will be feasible to rip out a lot of 
the middleware. And then? And then we have an emacs OS. The Linux Kernel, 
`mount`, and emacs. As it is now the main issue with using straight emacs is 
that the tty is a bad terminal.
That reminds me. Gotta try something. Night.

* 2022-02-11 9:45 pm
I feel mad and sad. I have the pressure of doing that paperwork looming over 
me. I sort of want to ignore it and move away. Just leave this community for a 
bit until it stops mattering. It think Gabe hates me. I know he doesn't, but I 
still resent him. He's probably right, and he's treating me fairly. I just 
don't have the context or time or patience to really get on the same page with 
him.
At the end of the day I guess this isn't about him really. It's about me 
accepting where I am in life and what I must do. And I'm just not there. I want 
to ignore it and go on with the perks without losing that status as a kid.
The System is a big problem, and most of my vexations are caused by it. It's 
not my fault. In a better world I would have no conflict.
But in a worse world I would say that about this one. So let's just say this is 
the better possibility.
Boom. Depression destroyed with facts and logic. But obviously that's not 
sufficient. Need more.
The depression must have seeped in today. It really wasn't this bad. Let me go 
to the apparent source to alleviate this.

* 2022-02-11 11:06 pm
Well I filled out the documents and am feeling a bit better. Just called Mom to 
ask about printing and she didn't pick up. So huh. Also it looks like I made 
the elite council of Retreat Helpers-- which also includes Murray-sensei. No. 
He no longer teaches, nor am I his student. Murray-sama then.
Only one more hurdle: Safe Environment. From what I've heard, it's just a 
reactionary BS wrapper around somewhat-unknown common sense. I need to stop 
holding myself in such a paradoxical regard.

* 2022-02-12 10:25 pm
Nothing to say?
Emacs was taking several seconds to start. This was unacceptable so I deleted 
the original config. This new one uses a better packaging system, avoids 
lambdas and recursion, prefers native features where practical, and echoes its 
startup time in the messages area. It's now sitting below half a second so I'm 
pretty satisfied.
My eye is like dying. It's fine, but it's really not. I'm typing this blind and 
hoping it comes out okay. Editing it later of course. Surprisingly good...
Alright. Time to not sleep. Just had a dew for some reason.

