musings_log.html

<div id="outline-container-org794cb03" class="outline-2">
<h2 id="org794cb03">2022-02-13 9:44 pm</h2>
<div class="outline-text-2" id="text-org794cb03">
<p>
It went smoothly. Office Depot to print the forms, retreat meeting, -etc- there 
was nothing else. Came home and did nothing. Tried to reinstall fedora from 
within itself to fix the dns issue, but couldn't get a mirror configured. 
Booted from live, chrooted in, installed stuff, ended up locked out of the 
system. Broken Pam and everything. Reinstalled again. It hurts. But now 
everything except tiling and emacs all-the-icons-font seems to work&#x2026; Gotta 
enable that declaration. And set up silencing compiler errors for the 
native-comp pure GTK branch. I'm actually pretty excited, but I'm wearing pants 
to bed so it's hard to relax. But I have to so I will. Good night.
</p>
</div>

<div id="outline-container-org223e526" class="outline-3">
<h3 id="org223e526">Best thing:</h3>
<div class="outline-text-3" id="text-org223e526">
<p>
I don't know. The hair. Let's say the hair. 
</p>

<p>
Hey, let's write that installation script!
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2970fe" class="outline-2">
<h2 id="orgf2970fe">2022-02-14 10:09 pm</h2>
<div class="outline-text-2" id="text-orgf2970fe">
</div>
<div id="outline-container-orgb1a8275" class="outline-3">
<h3 id="orgb1a8275">Best thing:</h3>
<div class="outline-text-3" id="text-orgb1a8275">
<p>
 new daily exercise. Walking up to top of stairs, then to basement, then back 
to apt. Simple. Easy enough. Yet still consumes a fair amount of energy.
</p>

<p>
Also. Playing with emacs launcher window. I'd like to have it bound to s-e and 
open a fuzzy-finding file picker that then opens a new emacs frame and closes 
the current one. Or maybe put it on the bottom of the screen and leave it 
there. Call it a desktop panel or something. Like exwm but not bad. Also, we 
can create new frames but not disable windows. For some reason. Redefining the 
function leads to insanity. I don't understand enough to solve it yet. Hey 
let's put that on top and put the modeline on the bottom. Can that happen? Will 
investigate tomorrow. I'm not quite tired but I should sleep.
</p>
</div>
</div>
</div>

<div id="outline-container-org7427d29" class="outline-2">
<h2 id="org7427d29">2022-02-15 10:18 pm</h2>
<div class="outline-text-2" id="text-org7427d29">
</div>
<div id="outline-container-orge07b0e1" class="outline-3">
<h3 id="orge07b0e1">Best thing:</h3>
<div class="outline-text-3" id="text-orge07b0e1">
<p>
 went and bought TV stand. What I ended up with is janky, but at least it 
exists.
</p>

<p>
Emacs modeline as external frame is totally a thing, but it's kind of bad. The 
highlight groups don't really transfer over, and it needs to pretend to be 
focused. There's some work to be done.
</p>

<p>
2022-02-16 10:07 pm
Tired. But not really, just bored. Spent a while fixing my zplug config because 
the environment variables got messed up in converting to Org-mode. Well, it's 
fixed now. Painfully. I gotta fix the rest of the emacs configuration. Line 
numbers in Org and all that. Maybe get back the scrollbar and skinny font. 
Still haven't tried updating to pure-GTK properly yet. But hey, Mushoku Tensei 
s2 is downloading so I can watch that tomorrow.
</p>
</div>
</div>

<div id="outline-container-orge6b43db" class="outline-3">
<h3 id="orge6b43db">Best thing:</h3>
<div class="outline-text-3" id="text-orge6b43db">
<p>
 fixed zplug, and got strike through in Org-mode. It's plus signs, for future 
reference.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbd882ac" class="outline-2">
<h2 id="orgbd882ac">2022-02-18 0:11 am</h2>
<div class="outline-text-2" id="text-orgbd882ac">
<p>
Counting this as last night.
</p>
</div>
<div id="outline-container-org02e9a8e" class="outline-3">
<h3 id="org02e9a8e">Best thing:  did laundry and showered. Ate la Cabana leftovers. Watched</h3>
<div class="outline-text-3" id="text-org02e9a8e">
<p>
Mushoku Tensei part 2. This is gonna be a long one. Of course we have to wait&#x2026;
Give me a minute. This show has prodded me. Our boy caved. It was her idea, at 
her insistence, and felt inevitable. But wrong. She was in a dark place and 
using him. She was in no place to consent. Consent? Fake. Need to redefine. 
Anyway. He rejected at first but wasn't thinking right. I was screaming at him, 
"this is not your arc" etc. And it wasn't. And she left in the night and 
unknowingly destroyed him. The guy's fragile. His default addiction is 
crippling despair, and she just leaves him there without so much as a goodbye. 
Just a note "we're not compatible rn bye". Yeah, they weren't. She couldn't 
understand him at all. Well how could she know? Huh. She put too much on him, 
and resented that. All in her head. Again, not capable of consent.
</p>

<p>
Here's my thoughts on consent: everybody's mental state is greatly influenced 
by their recent experience and past growth environments. Basically, what you 
look at as a mind is a tiny kernel of decision, some low-level but very 
abstracted drivers for behavior loops, an aggregate database of the past's 
highlights, and a huge storm of noise and junk knocking it all over. Most of 
the things anyone does, they don't think about or even know about. It's 
autopilot. Feedback loops and behavior drivers. When you knock someone out of 
their loop things get weird. They immediately take ownership of their actions 
up to this point <span class="underline">that they remember</span>, recontextualize these according to their 
current model of behavior, and pretend to be contiguous with their autopilot 
mode.
</p>

<p>
Enter mortal events. Like mortal sins but without the religious aspect. 
Basically anything involving addiction, sex, or other artificial alteration of 
brain chemistry. After the mortal event, you re-frame everything before it as a 
lead-up and everything after as the fallout, the sequel. The event is added to 
the highlights database.
</p>

<p>
Autopilot is resumed, but the patterns are different. The mortal event has 
introduced a trigger, a hook: things related to it will catch your eye. In 
extreme cases, a complex may be developed around it. This is how I feel about 
sexuality in general and innuendo in particular. It pisses me off for the sole 
reason (not the only, but a major) that I was once blind to it and consider its 
existence a betrayal of my innocence.
</p>
</div>
</div>
</div>

<div id="outline-container-org9b2bcfd" class="outline-2">
<h2 id="org9b2bcfd">2022-02-18 11:35 pm</h2>
<div class="outline-text-2" id="text-org9b2bcfd">
<p>
Didn't go to retreat. Gonna relax and stew here. Hate hate hate. Love it and 
hate the taste. Maybe buy a flip phone and hack it. You can get Busybox, so 
emacs can't be that far off.
</p>
</div>

<div id="outline-container-orge2601d8" class="outline-3">
<h3 id="orge2601d8">Best thing:</h3>
<div class="outline-text-3" id="text-orge2601d8">
<p>
 driving to McDonald's in the morning. Wonderful. I want to drive more 
tomorrow. But like, money. And food. Etc.
</p>

<p>
Got through a few episodes of attack on Titan. Up to the first twist. I think I 
hate all the characters. Mikasa least maybe. And that Sir Patrick Stewart 
general is pretty cool too. He better die a noble death.
</p>

<p>
I think I don't care for action. It's always the weakest part of the episode. 
Even when you are Mushoku Tensei and blew your whole budget on some sexualized 
bread tearing. Everybody raves about the amazing bread animation. But it's an 
awkward shot, and the movement is unnatural. Could have been way better with 
more shadow maybe, to draw out distinct shapes. Now I'm ranting about the bread 
too.
</p>
</div>
</div>
</div>

<div id="outline-container-orga58311e" class="outline-2">
<h2 id="orga58311e">2022-02-19 sometime morning?</h2>
<div class="outline-text-2" id="text-orga58311e">
<p>
I don't believe it's better. Watch you go. I go, I go, look how I go. Ikuzo.
</p>

<p>
They didn't call. Didn't question me. That means they didn't need me. Oh well. 
Cool then.
</p>

<p>
Don't count on me! Don't put your blame on me.
Couldn't find the phone I was looking for. Target was out, Fred Meyer only had 
the ATT version. Not ordering online because reasons. It looks like a good day 
out there.
</p>

<p>
Where's my Android lisp ide?
</p>
</div>
</div>

<div id="outline-container-orgb29ee18" class="outline-2">
<h2 id="orgb29ee18">2022-02-21 3:05 pm</h2>
<div class="outline-text-2" id="text-orgb29ee18">
<p>
Had no night last night. Drove to Eagle River for no reason, got a snack, came 
back. 
</p>
</div>
<div id="outline-container-org112a030" class="outline-3">
<h3 id="org112a030">Best thing of Saturday:</h3>
<div class="outline-text-3" id="text-org112a030">
<p>
not finding phone. 
</p>
</div>
</div>
<div id="outline-container-orgb5f5a08" class="outline-3">
<h3 id="orgb5f5a08">Sunday:</h3>
<div class="outline-text-3" id="text-orgb5f5a08">
<p>
taking out garbage. 
</p>
</div>
</div>
<div id="outline-container-org6dcffcd" class="outline-3">
<h3 id="org6dcffcd">Today:</h3>
<div class="outline-text-3" id="text-org6dcffcd">
<p>
TBD. If I don't say later, put waking up.
</p>
</div>
</div>
</div>
