org/musings_log.org
* 2022-02-21 9:36 pm
Wow. Attack on Titan is crazy. Those first few episodes were still a drag and I 
don't regret dropping it. But there's enough mystery expansion to sort of make 
it watchable and interesting for me.
My head hurts. I was up really late last night. Had way too much caffeine and 
salt today. Actually no caffeine. Maybe that's why. It hurts. I will try to 
sleep.

* 2022-02-22 9:44 pm
Head hurt all day today. Had a piece of underripe pineapple for lunch.
Best thing: this moment right now. My head is finally clear. My nose is 
evacuated. It's all better.
I was really mad today. At least, I said I was. I set up all those meetings for 
yesterday and Josh blew them away like it was nothing. Told everybody the 
office was closed. The nerve! I will rage at him. I will complain. I get there 
every morning! I keep Jon company and listen to his ravings. I put up with 
Gene's annoyances. I call and apologize for him missing his appointments. And 
for what? For him to just throw it away. Well no. I won't have this. I don't 
mind getting paid for no effort that amounts to something, but if you dare make 
me try, it had better mean something! That's stupid. Stop lying and saying 
you'll be here before lunch. Stop pushing back all these meetings.
But I kind of don't care. Right now. And in the moment I wasn't fully sincere. 
I was disappointed and a little surprised and felt indulgent, so I said I was 
angry. And in saying, validated that anger.
Good night.

* 2022-02-25 10:57 pm
Best thing of 2/23: telling Josh I was upset. He said I'll "just have to get 
used to it". Ass.
Best thing of 2/24: Mac n cheese I guess. Nothing notable enough had happened.
Best thing of today 2/25: finally got something to install on the chonktab. I 
think I'll recreate my old configuration.
The Chris Chan legend fascinates me. I could have been him. In his time, with 
his influences. Not a huge jump. But I was more focused, and scrupulous, and 
nobody bothered abandoning me. So I stumble through my role in society in quiet 
and accepting rage.
I was always told to evaluate people without taking race or societal 
stereotypes into account. This made sense and was unanimously told to me, so I 
presumed it an obvious and ubiquitous truth. I heard of efforts to end racism 
and thought it was good to have already sorted that out. I saw Obama and heard 
that he was bad, and when asked was given some mumbling about taxes and wealth 
distribution and foreign policy. I believed this and thought little of it. Only 
that, it was a shame that the first black president turned out to be a bad one. 
I saw some random black people and they didn't seem to fit in. I gave them the 
same welcoming indifference as I would anyone else. Note here about gender 
inequality. Whatever. Anyway. I heard Trump and was relieved to hear such a 
blunt and based take. I heard slander that he hated Mexicans and kept listening 
to determine the truth. I was told that he merely hated the destructive ones 
who sought to enter America. I did not pursue this any further. I overheard 
that the right were racist. This confused me, as I was on the right and knew no 
racists. I mentioned at school that this was a pointless fight as racism is 
dead. Angel told me it wasn't. She elaborated that there were racists to the 
South, in the L48 and sub Panama. I accepted this, shaken at my lacking of 
critical information. This would be the first but not the last of her bursting 
my bubble. I still hold that Trump is not a racist, but acknowledge that his 
words have attracted and emboldened racists. This upsets me because I like 
Trump. 
I want race acceleration. My thinking is, racial traits in humans are just 
small scale evolutionary optimization. The blacks are black because it protects 
them from sunburn and skin cancer. They are prone to sickle cell because it 
protects them from malaria. Likewise the whites are white because they need to 
take in more vitamin D from sunlight. And likewise most every "racial" 
distinguishing trait is a simple and inevitable artifact of their amcestors' 
environment and should be treated as such. Some of these traits, perhaps most, 
are desirable for all humanity to have in the future. Thus, where possible, we 
should... You know...
I've always had that dream of a white blond wife and white kids and being a 
white old grandpa with white hair and a white beard and a white photo of my 
white dead wife and parents. Unlike ChrisChan, my delusion of a fated bride 
never dared reach that far with specifics. But it was implicit in all my 
thinking. In preschool there was a girl Ruthie Taygan. I hope I spelled that 
wrong. We promised to marry from across the leg of a small tallish table. It 
was preschool so everything was tall. I can't remember her face and wouldn't 
recall it from a photo of the time. I don't remember who started or proposed 
it, but it went something like:
"hey, will you marry me when we grow up?"
"sure why not"
"OK thanks"
"is this okay to commit to so early?"
"nah but it's probably fine"
This is translated, of course. From barely learned simple English. Though I 
have no memory of her being inferior to me. Not like No Clue Kid. I may have 
told his vignette already. I purposefully threw an accidentally-hard snowball 
at him, and successfully coincidentally made him bleed. He was crying and I was 
confused and felt betrayed by the stereotype of the innocent harmless snowball 
fight.
What else did I learn in that preschool? What a wart is. Teacher-san called it 
a wart and I misheard. I referred to it as a bumbp. I came home and my parents 
asked me what it was and that's what I told them. The next day I went back and 
told the teacher it wasn't a wart, it was a bumbp.
I lost a tooth. It was hanging by a thread, as baby teeth do, and I bit into a 
fruit leather. It was the green apple kind. I bit fine and got it halfway into 
my mouth but it felt weird so I took it out and the tooth was stuck in it. It 
was one of the big upper front teeth. I think. Maybe a canine.
I think I sat out a game of tag. This was to become a pattern. I hated tag till 
I was old enough that it never came up.
Learned of the pupil of the eye. I think I was told of that before and this was 
a reminder. I knew that pupil meant student and did some wordplay with the 
teacher that confused both of us. She explained the other meaning to everyone 
else.
Might revisit the preschool memories later. This is all I'm recalling for now.

* 2022-02-26 4:23 pm
Charlie says he'll come with Lill and her sister's truck and his couch. At 
7:20ish. We'll see how that goes. I'd maybe clean up but up to a point it 
doesn't matter. I want to appear together but not totally hygienic. It's a 
better plot than strapping it to the car...

* 2022-02-26 11:05 pm
Went fine. They came over, Lillian stayed in the truck, Charlie and I made 2 
trips.
Best thing:  finally recorded YouTube video. Latest since 4 months. Gomenasorry 
about the shallow take.

