org/musings_log.org
* 2022-02-26 11:17 pm
Bad take bad take: suicide.
I'm not suicidal. But when I was (or was close), I was acutely aware that the 
"suicide hotlines" etc were dumb. How can someone on the other side of the 
world understand at all? And how do you expect a person in such a state to ever 
call? Please correct me if I'm missing critical information here. I'm just 
enraged that such a stupid institution would exist.
Bad take bad take: passive ethical eugenics.
They're banning anti-vaxxers on discord right now. But why? It would be so much 
more efficient to just let them carry on, then they and their children die and 
the whole future sees the fruits of their idiocy. This overuse of the ban 
hammer is not merely authoritarian, it is moronic.
The inverse should be said of the generally weak. If someone cannot naturally 
function in society nor bootstrap themselves despite an issue, letting them 
produce offspring is reckless. Sure it's nice and we feel good about empowering 
the helpless. But in the grand scheme, it makes no sense. By passing down a 
defect, you are cursing all of future humanity with it (since after a few 
hundred years the gene pool is remixed). Now, since some extremely positive 
traits are tied to extremely negative ones (cosnmically preserving the balance 
of each human). In these cases let time tell whether this trade off is worth 
it. If they succeed by coincidence, cool. If they fail inevitably, oh well. We 
shall passively await a better version of the trait to pop up. And passively 
allow them to win in life. This may sound shallow because I am reducing 
personal growth to successful reproduction and the individual to a data point. 
But am I wrong?
I do not know if bad sight is genetic. But if it is, then glasses are hugely 
evil an invention. They have created complacency. People are enabled to be 
parents despite a cripplingly undesirable trait.
Sex is not the only success. Contributing to the understanding of humanity is 
also a success. And if someone with bad sight, or broken reproductive organs, 
etc accomplishes this, they should be revered for their accomplishments above 
those who merely fuck and live on. But it is better for one to both accomplish 
great advancement _and_ fuck.
I'm falling asleep.

* 2022-02-27 8:47 pm
Best thing: working on fixing emacs relative line numbers. It's kind of stupid 
how this isn't yet a thing.
Basically, in vim you have a couple options. `set number` turns on absolute 
line numbers on the left. Emacs has always done this in multiple ways and that 
is no problem. Vim `set relativenumber` displays each line number as the 
absolute value of the distance from the current line, with the current line as 
0. Emacs can do this also in a couple ways. But vim has an awesome behavior 
when you combine the 2 (`set number relativenumber`): it displays the 
non-current numbers as in relative to current, but the current line's absolute 
number from the top, with the current number left justified so as to pop out 
from the relative numbers. Emacs has no notion of this so I spent several hours 
attempting to build it from scratch. Haven't succeeded yet and there are still 
some major issues. But it's probably possible.
My head is spinning with the absurdity of Chris Chan. The grammatical dialect, 
the interweaving yet contradictory delusions, the nave self-righteousness, 
the pointless retcons. And of course the influence of the trolls.

* 2022-02-28 7:36 am
I had a dream. I was working for Walmart against the thieves and my job was to 
hide in a couch near the front wall that they sat on. I spoke from behind them 
and said something nonsense about silverfish and Minnesota, then gave them a 
warning that at 2 in the morning they would be arrested. It was 10 pm. I then 
went out to my car and stood next to the door. My accomplice, an overweight egg 
head type girl, came out. I sort of weakly yelled to her are we supposed to 
stay here, but she didn't hear me enough to respond. I saw some cops and it was 
weird because we were in cahoots but I didn't trust them.

* 2022-02-28 8:22 pm
On hanime I saw a comment: "I would switch to this school in a heartbeat". The 
school in question has a ritual in which the three highest scoring boys at 
tennis each pick a girl to do sexual things with. I had accepted the premise 
and found it hot provided the twist that the MC was shy and the girl he liked 
chose him instead. But that comment broke me out of it. How could you _want_ 
such unequal degeneracy? And yet, I am afraid that if I were in that school I 
would make my peace with it, and even play the tennis and be in the room, and 
would speak out against the ritual but secretly get good so as to be forced to 
participate in the degeneracy.

* 2022-02-28 9:33 pm
Best thing of today: writing schedule.ps1 script. Hopefully John will bring 
over his copy of Visual Studio so I can bundle the pdf parser dependencies. For 
now it just pops open all the court pdfs, which is nice but kind of a strain on 
the computer. Parsing the pdfs themselves would be much better. Also we gotta 
see about spam-opening court view. Parsing shouldn't be so much a problem cause 
that's all html and hasn't been updated in 10 years. It's the redundant 
database queries that get me.
Windows scripting is strange, annoying, but refreshing experience. A lot of 
looking up simple things because their manpager is garbage, but complex filters 
just work without weird sed nonsense. Which is really nice. I'm not convinced 
that visual studio will be worth it. The it being free with a shallow learning 
curve. It's Microsoft garbage so I'm skeptical, but if it works and is portable 
I can't complain. Also had to rewrite the script from memory today due to a 
botched copy/move operation. Stupid powershell coreutils...

* 2022-03-01 7:22 am
Had a dream. Setting was like Attack on Titan but without the walls or odm gear 
or anything. The however-many of us were at the park when we realized what had 
happened, that everyone not present was a deadly monster. My father was locked 
in our dungeon for maternal incest. Me (or at least who I was looking through 
the eyes of) had 3 siblings. A badass and stoic older brother, a badass and 
chill older sister, and a sweet and cute younger sister. After we learned of 
Dad's actions, the younger sister and I began to fondle and fuck every night. 
The older 2 came back from an expedition and sat on the wall bench opposite us. 
Older brother began to sleep, out cold. Older sister was giving me ambiguous 
eyes (I can't remember what led me to the following action). I kissed younger 
sister and she fell asleep instantly. I looked up at older sister and she said 
"how did you know" and we made out.
Also somewhere in this same night's dream. There was a battle with a Titan near 
a small cliff and a bendy tree. A guy got swallowed and we threw him some gold 
to make the Titan throw him up. It didn't work, but thankfully the Titan did 
have a digestive tract so he came out the other side with the big chunk of gold 
and hightailed it away. The guy trying to rescue him had been using the bendy 
tree as a spring and ladder and jumping aid.

