org/musings_log.org
* 2022-03-01 8:27 pm
Today. Was a day. Went to la Cabana for fat Tuesday. Guess I'd better fast on 
something slow.
Now I remember the worst thing about the existence of sex. It is this: the 
assumption that guys want it, that this is a primary and insatiable desire for 
us, and that we are thus an inevitable danger to women and children. I believe 
in children and teenagers. I have seen firsthand the hope and passion and depth 
of experience. But I am 18. Almost 19. And that makes me a Young Adult. Which 
makes me unable to... I'm getting the internal embarrassment that this is all 
in my head and if I just tried it would be fine. But I'll rage some more here 
anyway. It makes me unable to interact in a casual and friendly way with anyone 
younger and/or of opposite gender. If I talk to a guy within one year or 2 
below me that's fine. Any more and I'm a disgusting gay pedo pervert. If I talk 
to a girl under 18, I'm grooming them to want sex when they "grow up". This 
can't be a wholly inaccurate view of the world, right? So. I wish I were like 
60. Guys who are 60 and have long flowing beards and a public position and 
hedge funds that leak into the public benefit and have written a book or 2 that 
none of their friends would read because it's too specific but it would really 
be a good read for anyone: those kind of guy is what I want to be. An eccentric 
and smart, yet wholesome, everyone's favorite uncle type guy. If neither myself 
nor society will let me be an _ore_, at least let my _watashi_ not ring hollow.
Man, I just realized something. This document is going to be very cringe when I 
read it back next year. I'm going to do all kinds of things to it and it's 
going on my website. But I'm thinking I should get a therapist and tell them 
all about this. And show them the document. I bet they would upcharge me. Aye, 
that would cost money and money is something I don't feel like spending. It's 
fine, of course: I have loads of extra money.
Should I quit this and go to college? I could maybe still get into Thomas More. 
I'd study theology/psychology, then go into law. I could be a lawyer like Josh 
but not drinking. Can't be harder than being Jon right now... He's made the 
best of a messy start up till now. Josh had a great start and that's a crutch 
for him. Gene needs left no start, for he is past his end. And I... I have not 
yet started.
I need to not wish to be a different age. Such brings only pain, regret, and 
pre-gret. Maybe it'll be better then. But if so, the least I can do is cope now 
in a way to set up my then to be better.
That dream last night was f'd up. I should not have had it. But I did, so may 
as well say it. Here's to a better one tonight.
Best thing of today: working more on powershell script that opens all calendar 
pages. Now it skips the ones we'd never want. Need John to bring in the visual 
studio cd to bundle the pdf dependencies. Hang on. I used this yesterday. He 
forgot to bring the disc in.
Actual best thing of today: writing in here. I've brought myself down.

* 2022-03-02 9:19 pm
Best thing: emacs load-path. It was frustrating but I finally got it in there. 
Always put (provide 'thing) in the file to be loaded and (require 'thing) 
before where it needs to be loaded. Nothing I read said that directly, so the 
realization came like a stupid and blinding suspicion.
I want to write a new lisp in zsh. Just saw a post about a guy writing a scheme 
in python and he gave some good tips:
- there are 3 parts of an interpreter:
  1. Parser
  2. Translator
  3. Evaluator
He then demonstrated how a lisp style list structure looks in python, and blew 
my mind. Also lisp is a tree structure, a data format and an executable string. 
The best of json and xml and ini, and the deepest of subatitutive programming.
I want to write all that emacs has from scratch, to understand it. I don't 
right now, and I doubt anyone fully does. There's a nano clone written fully in 
guile. I might try that.

* 2022-03-03 9:20 pm
Best thing: decided to give up YouTube and spider solitaire. I've been wasting 
my time on them and need to stop.

* 2022-03-04 7:18 am
Friday... Without youtu.be. Without solitaire. How will I do?

* 2022-03-04 10:20 pm
Best thing of today: I'll sleep in a moment. That shall be the best.
But first. I need to say a few things.
I am perplexed by the character Josh. He's oldish and has his life together, 
yet he's always late for things. He makes excuses like a 16 year old who's 
smart enough to make them true and lazy enough to keep them coming. He drinks 
all the time, yet his work consists of every allegorical instance to reject 
impairment. He has no sense of his car, or appliances. He buys food and lets it 
rot in the fridge. Now he's supposedly giving up alcohol for lent. I don't know 
whether to be afraid or overjoyed. Certainly not overjoyed. Mildly impressed? 
Still. Too little too late? The guy is stringing us along. At least I'm getting 
money from it. I should find a new job. But this is so chill... No it's not, no 
its not. I have no life left. No time to do other things. The weekend is a 
curse that makes me decompress so I am softened under Monday's harsh blows.

* 2022-03-06 2:42 am
Counting this as yesterday. Best thing: installing windows 10 virtual machine 
for visual studio. Now I'm having to write visual basic and it's confusing.
After all... To end... I'm so tired.

* 2022-03-06 5:33 pm
My wifi Hotspot broke this morning. I'm not sure what happened, but it appears 
to be an internal dns issue. Switching connection managers or even using an 
android doesn't appear to help, though.
I'm so fat. I've eaten so much, and cared so little. I used up all the eggs 
today. Have to buy more plus milk tomorrow. I'll eat that milk as cheeto Mac 
and finish that as well. Tomorrow will be bad. I'm not in a good place mentally 
and Josh will probably be in early. Which means more hassles. Less than a week 
into Lent and I've already broken it all.

