org/musings_log.org
* 2022-03-06 6:08 pm
Hmmm. Not a ton to say. It's been 3 months into the year 2022. That's a 
quarter. Nah, it's really more 2 months. That's 1/6. Less impressive. Well, 
soon I'll be 19. A whole year of adulthood. A whole wasted worthless year of 
filler. Nay, quite the opposite. I wrapped up a lot of arcs and began lots of 
new ones. The high school meta is out now, the cut-cast office sitcom drama 
slice-of-life survival guide is in. I've said before in here that this is the 
worst time of my life. I said that for reasons: I'm old. Too old to be a high 
schooler anymore. I understand ChrisChan in how he felt on losing high school. 
They dump you with nothing. Then again, I'm more troubled than Chris, and thus 
more useful and self-conscious. So my life isn't over. I don't have the support 
network for it to be over. I'd honestly like to ditch this job and just live as 
a landwhale in some benevolent basement, but I don't see one around. Not where 
I could hide from those who wish the best for me. Just let me screw myself 
over! Ay, my life like this is revenge. A passive and fruitless internal 
vendetta against the voices without. Dad, telling me to stop hiding and do 
something. Mom, nagging me to avoid "sin" and making bad-faith arguments. Gene, 
thanking me for nothing and saying mom is proud of me. But what of the rest in 
my life? What of Charles? What of Lillian? She is no longer in my life. We have 
no excuse to interact, and I am ashamed. Ashamed to presume I could sympathize, 
empathize, with a woman. Especially one with so much pain within and without. 
My life is a cake walk compared to hers. Or so it seemed last I bothered 
reflecting. When I left Dad's home. I called her. I had thought I was in a bad 
place, but it was her. I was fine. I didn't realize on the call, of course. I 
wanted to live on her property. I wanted to flirt. I wanted to "help". To help. 
By listening, and learning, and saying the right things. Did I want that for 
her sake? I know I wanted it for mine. I wanted a de facto mate. Just like 
ChrisChan. I wanted to have her. I wanted her to be mine. And together we would 
discuss and discover what it meant to be woman, or man. She would help me out 
of my shell, and I would step her out of hers. Truly, my fantasy reached up to 
the heavens. And we would be good and true Catholics working to conquer our 
vices.
But no.
She had already latched onto Charles. I can't wrest her away. And I shouldn't. 
I'm childish. I am a silly little boku wa baka.
When I called her as I ran, I had been watching re:zero. And Subaru, Our Guy, 
is like Charles. I identified with him and thought I could be "that person". 
Whatever. My passions are calling. Time to watch the last half of the first 
half of the last season of attack on Titan, a show I dropped after episode 4.

* 2022-03-06 8:48 pm
Best thing of today: the ice cream. Birthday cake flavor. It is truly the 
nectar of the gods. I certainly didn't do anything to be proud of...

* 2022-03-07 9:44 pm
Best thing of today: shredding. So chill.
I broke professionalism today. Daron called and begged for money. He said he 
was lucky he had a heart attack yesterday so he didn't freeze overnight. I told 
him why don't you do it again. I told John in an apologetic manner and he was a 
little disappointed but understood. He said he wouldn't fire me for something 
he would have done himself. I hope they lock that loser up.
It's a strange thing: Daron is a loser. Josh and I are winners. What's the 
difference? How does Josh win? Must be circumstances and quick talking. 
Everyone who wins has some merit and some luck to it. Take John. He was born 
into a network of infamy and fame, where everyone is a crazy rich loser, and he 
was taught to maximize capital at an early age. This was his luck. But he ran, 
and struck out, and learned, and made himself useful. This was his skill. The 
thorn is his failing body, and his kindness toward losers. Kevin is a loser. 
Yet John cannot shake Kevin, for he has hope. He denies it, but he does. He 
says he'll buy Kevin an apartment, pay the first few months, and kick him out. 
But that will not happen. Kevin couldn't keep a job if he wanted to, and he 
doesn't want to. John cannot comprehend this and keeps giving him more chances. 
And what can he do? His only remaining course of action is to continue on the 
current trajectory: support the loser, but complain about it. This is John's 
vent: the Complain.
I'll try again. I want to use Windows on the chonktab. But no drivers will 
present themselves, etc. So I will have to use a thin Linux as the host. I want 
it small and declarative if possible. A nixos? Nay, a guix. Because lisp. I'll 
write an os loader for windows in lisp, and slap it on github. Throw it out on 
r/Linux too maybe. Worst that happens is I get banned from reddit. Which I 
haven't used in months. Best is I get fame as "the guy who solved windows 
drivers forever".

* 2022-03-08 7:21 am
No reddit and no YouTube. My brain wants stimulation right now. But I have none 
to give it. I have to look at reality, at the silly waste of my organization of 
this apartment. I should really reach out and ask for a studio when one becomes 
available. It'll be a money sink initially, but will save tons in the long run. 
But I'm nervous. I feel inferior. I brought the scourge of bedbugs upon this 
place, and I'd hate to make it any worse. Or to look like I wanted to or didn't 
care. I want to look like one who cares immensely. Who goes his own way but his 
way is right. Is that possible? Is that worth anything? It's insincere at the 
very least. I don't mind the bedbugs. We have reached an acceptable stalemate, 
and in my judgment further squabbles will accomplish nothing. But in the eyes 
of the world, this is complacency. They will not let them an inch, for they 
take the mile. And yet, they take their own inch too. They are a force of 
nature, like the rays of the sun. To truly eradicate them would be to slaughter 
all of humanity. Which if you care enough would be an acceptable solution to 
me. But I doubt that those who presume to hate bedbugs would dare go that far.

