musings_log.html

<div id="outline-container-org1d0ee81" class="outline-2">
<h2 id="org1d0ee81">2022-03-08 8:50 pm</h2>
<div class="outline-text-2" id="text-org1d0ee81">
<p>
Bad. Bad bad bad. What do we idly wish for, and where do our dark daydreams 
destinate? Mom is breaking down. Her mind has begun to crumble, and she isn't 
aware enough to keep up. Let alone limit herself to conserve thought. Now she's 
texting again with "hope you enjoyed your day". I'm worried. I'm hella worried. 
What happens when she goes vegetative? Well, I'll go there on Saturday to see 
how bad it is. She was sort of okay before. Oh. I gotta talk to Gene. ask him 
if he's noticed anything like this. He might know who to call too. I need to 
get her a doctor or something.
</p>

<p>
This is stupid. She's not old yet. She's not even 60. She has many more years 
to live out in obscure and competent peace.
</p>

<p>
I've wished her to die. I've fantasized about her funeral. I would be quiet, 
stoic, somber. To the outside it would look like her death brought me back to 
church. Which it would. But really it would be a pure convenience. I don't want 
to go to church with her or without her when she's there. I can't make her 
leave. So her dying is the perfect resolution for my comfort zone. Such 
convenience. I've outgrown her, after all.
But that fantasy is falling apart. Now that she is going in the most horrifying 
way possible. I mean, I'd be terrified to go that way. But I treasure my mind. 
She took hers for granted, and I suspect this has been going on for a while.
All those years ago. I didn't grow out of her, she began to collapse and I 
didn't notice. Dad didn't notice. We were too caught up in our own changes to 
think anything of it. And we lost her.
</p>

<p>
I need to call Dad and keep him in the loop.
</p>
</div>
</div>

<div id="outline-container-orgaf8c142" class="outline-2">
<h2 id="orgaf8c142">2022-03-09 6:57 am</h2>
<div class="outline-text-2" id="text-orgaf8c142">
<p>
Woke up early this morning. Too much dew. Now I shall play on the computer, 
striving for the ideal state.
</p>

<p>
I will wait on telling dad. No, I can't wait. But I will. Ehh. I can't tell him 
but I can't not.
</p>
</div>
</div>

<div id="outline-container-org380eb9d" class="outline-2">
<h2 id="org380eb9d">2022-03-09 9:58 pm</h2>
<div class="outline-text-2" id="text-org380eb9d">
<p>
In a few hours I will count as 19 on the public record. It doesn't mean much 
but I can inject whatever meaning I want and have it stick. This is a chance, 
not to be wasted on cheap disappointment.
</p>

<p>
How about: each week I will learn a new Japanese character. If not quicker. I 
will spend a comfortable time to deeply understand what it is and how it 
behaves in context. It will be the subject of my daydreaming.
</p>

<p>
Alright. Cool. Anyway&#x2026; On to normal business.
Best thing of today: schedule script is coming together. The sh part is 
trivial, the Python part must not be touched, and the pwsh part is pretty well 
refined. I want to add a simple markdown or tex template and have it generate a 
docx or some such. In the same format as Jon's hand-written word files now. 
It's so close. And then I'll slowly convert the whole project to PowerShell, 
and then make it bootstrap its own dependencies, and then ship that as an exe.
</p>
</div>
</div>

<div id="outline-container-org14deb32" class="outline-2">
<h2 id="org14deb32">2022-03-10 7:22 am</h2>
<div class="outline-text-2" id="text-org14deb32">
<p>
It's time. It's good morning. I am awake and I am 19. I've lost too much to 
time, I shan't lose this too.
</p>

<p>
I had a dream last night. I was a skeleton like Ains Ooal Gown and was trapped 
dormant in a cave of some kind. Also there was Emilia from re:zero on a dog 
sled traveling north in the Glenn highway right before Butte exit. But the exit 
wasn't there and the road was closer to the mountains. She was right behind 
several huge semi trucks. They all suddenly peeled off the road and she flew 
very fast toward Palmer. I was still in the cave, standing perfectly still. I 
had been discovered many times throughout the centuries, but never given any 
food.
</p>
</div>
</div>

<div id="outline-container-orgc846744" class="outline-2">
<h2 id="orgc846744">2022-03-10 9:17 pm</h2>
<div class="outline-text-2" id="text-orgc846744">
</div>
<div id="outline-container-orgb26ae9c" class="outline-3">
<h3 id="orgb26ae9c">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgb26ae9c">
<p>
converting the schedule script to (mostly) powershell. I still need to figure 
out grep though. The current thing just passes everything through. Maybe 
because powershell pipes work on objects and not true streams? Filter left, 
they say.
</p>

<p>
My day was okay. Woke up feeling pretty good in the morning. Then John drones 
on for a while, but eventually left me alone. La Cabana was fine, but I ate too 
much. Afternoon was kinda miserable with the digestion and filing. That copying 
at the end killed my mood and I had to get out of there. Then the rendezvous 
with Julie was mercifully short and I got to relax for an hour. Mom and Clarice 
kept calling me, which was annoying. But mom dropped off some candy so that was 
nice. Though she did slip some plain old sugar packets in there. Come on.
</p>

<p>
I need to stop being a pushover. I should be more rude. Or at least reject a 
fair percentage of optionals off hand. Man. I couldn't get a good break today. 
I hate that. Just leave me alone. Let me hide. Let me brood. Let me think. Let 
me breathe and hack. If I can't get friends, I don't want sympathy from 
acquaintances. I'm mentally deranged, and maybe even an introvert. Leave me 
alone. I'll come out when I need company. I know you'll be there. Somebody will 
be there. They can't not.
</p>

<p>
In the apartment there is peace. In the car there is peace. In the empty 
office, or without the boss, there is a sort of peace. In my room as a child 
there was peace. On the computer there is peace. On the toilet is peace. In bed 
is the best peace of all.
</p>

<p>
Leave me alone. Why must you drag me out to suffer and gain? Leave me alone. 
How do you not understand this very basic human need? Leave me alone. 
Everything will go my way in life, except for you constantly bothering me. 
Leave me the hell alone. I don't care about your stupid cargo cult. Leave me 
the fuck alone. I would be okay with solitary prison. Just leave me alone. 
After all, this is very much a prison of sorts.
Hmm. Does this&#x2026; No. I can't. Can't think. I am tired and sugarbuzzed and I 
suspect tomorrow will be horrible. But with a single lie I could take it back. 
Just say mom poisoned me by accident, and I need to get it out of my system. 
That would be simple and easy and effective. But alas. I don't like lying. Too 
much liability. Haha pun. Bad pun. Has sound without meaning. I should write a 
thing on what makes a good pun good.
But now. Sleep.
</p>
</div>
</div>
</div>

<div id="outline-container-org3ac59ef" class="outline-2">
<h2 id="org3ac59ef">2022-03-11 6:57 pm</h2>
<div class="outline-text-2" id="text-org3ac59ef">
<p>
I know. I feel. I see. I breathe. I itch. I scratch it. And I always fall, a 
little short in front of you.
Ani-cli works on Android now. That's pretty cool. Not as cool as having a whole 
local streaming setup, but okay enough.
</p>

<p>
I was vulnerable today. I told Jon about Mom. I guess I'm kind of bound to do 
something about it now. And I hate that. I wish she'd just die. Leave me alone. 
Pay for your annoyingness and leave me alone forever. Better occasional regret 
than constant pestering. And I don't even believe in regret. Well, I have 1 
regret. One singular little regret. And it will not change till I lose the 
faculty itself. For I hate&#x2026; Nah. Leave it be. See, this is the problem. In my 
sane moments, I hate it. I would cut my penis off if that were an okay thing to 
do. Obviously it isn't so I don't. But when the mood strikes, I become 
protective, horny. What a horrible word. The etymology is presumably related to 
erection, but it doesn't mean erect. It is a mostly mental thing. That will 
then become physical arousal no matter what.
</p>
</div>
</div>
