org/musings_log.org
* 2022-03-11 11:40 pm
Best thing of today: reading re:zero. We got through the Darkest Moment and 
into some great lore teases.
The bedbug crew will come on Sunday, not tomorrow or today. A shame but oh 
well. I guess I'll lay about tomorrow and do real things Sunday.
Been re-adding the xfce config files to my dots repo. I want to use qtile as 
the window manager. It doesn't deal with xfdesktop well. I can see why I 
disabled it a year ago. But this time I'm going to make it right. I'll make it 
work with the default apps as intended. Every distro and desktop default will 
be usable in the same way. I've already done it for gnome and sway. Now if I 
can perfect xfce and make that the window manager... Wait. Why am I not 
leveraging the subarashii lisp WMs like rat poison, stump? There's so much 
potential there. It's lisp, after all. Okay. I'll do that. A major concern will 
be distro availability, though. We need a fallback. Xmonad bootstrap?

* 2022-03-12 7:37 pm
Best thing of today: getting out of mom and Clarice's presence. They're both so 
exhausting.
Qtile mostly works with xfce now. Just not xfdesktop. I am not sure how to 
handle that. Perhaps I should just switch to a more powerful WM. The Haskell 
dependencies for xmonad are just so troublesome.
So that Xbox controller. It doesn't work as a mouse, but it does work in games. 
I started a MC bedrock game.

* 2022-03-13 9:39 pm
I believe now that criticism of film or indeed any story can be valid and 
constructive. However, I do not think myself capable of such things. I do not 
notice, because I make everything explained through headcanon. I will believe 
anyone, accept any story beat, etc. As long as something does not disgust me I 
will come to love it.
Bought a MacBook today. A 2020 arm model. Why? Something to do. Something to 
hold when I lose my grip.
Best thing: sinking into this hot bed. It's so hot and nice. Okay.

* 2022-03-14 11:55 am
Aand as soon as I begin to write here life calls once more. I skipped the 
morning of work. Last night was awful. So hot and sweaty and bloated and 
accelerated. But I've had my slow wake today, so I'd better be okay.

* 2022-03-14 8:39 pm
And, to everyone's surprise, I was. Nothing happened, nothing was lost. I 
skipped the awful Monday morning, Jon had a slightly worse headache, nothing 
was lost. Man. Taco bell nacho fry burrito is the best. The pinnacle of both 
nacho fries and fry burritos. It's as if they were purposefully teasing this 
crossover from the beginning. And I am so here for it.
The m1 MacBook is awesome. The battery life alone is a living legend, mapping 
caps to esc was trivial, and homebrew for package management just werks. Mpv, 
alacritty, emacs, brave, my wallpapers, zsh-- it's just so smooth and 
refreshing. Even putting in my git credentials was a cinch. And the Amethyst 
window manager is literally a clone of xmonad with no effort required for 
config. Ssh works. File paths work. So many things work, it's almost hard to 
believe that Linux falls so short comparatively. I was going to have a huge run 
of revamping my config style to new default apps, but I don't need to because 
my own default apps just work.

* 2022-03-15 8:21 pm
Read some more re:zero today. My mind is blown and racing. Truly so much is 
just kind of happening right now. I can't wait for the end... But I need to 
sleep. Etc.
Best thing of today: KFC pot pie for lunch. That seems odd and disappointing. 
Oh well.
This goal of learning Japanese will not happen at the rate I had intended. It 
will be slower. Much slower. But I will come to comprehend it all. Eventually.

