musings_log.html

<div id="outline-container-org6f6a3c2" class="outline-2">
<h2 id="org6f6a3c2">2022-03-16 9:09 pm</h2>
<div class="outline-text-2" id="text-org6f6a3c2">
<p>
Re Zero continues to be subarashii desu. 
</p>
</div>
<div id="outline-container-orgd95ebb5" class="outline-3">
<h3 id="orgd95ebb5">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgd95ebb5">
<p>
sorting phone messages and starting on the rewrite of the Messages program. 
John gave me a copy of his version. It's a compiled exe but it's kind of 
garbage. Can't split text onto multiple lines. Won't add me to the drop down 
menu. Doesn't have a time or date override. Print dialog is janky. Whole thing 
is blurry. That's the thing, isn't it. The windows dialog is blurry. Huh. Well. 
I'm making a serious shot at it in powershell, and I'll write it such as to 
maximize hackability. Hopefully I can find an elegant shortcut to avoid 
copy-pasting all these properties. For loop? Hmm. Variables are different than 
in sh, so procedural variable generation may not be so simple. It's just a 
couple of drop down menus and a text field. Why do I care? I've seen the 
version where the author didn't care. I'm stuck with it for now. It's strange. 
Might be the first "bad software" I've ever used. And that's quite significant 
seeing as what happened in the distant past&#x2026;
</p>

<p>
Nevertheless, I'm super excited. I got home and was mad I couldn't keep working 
on it. I almost tried AppleScript. Which I kind of don't want to do.
</p>

<p>
The IDE cult is perplexing to me. It's like in these newer languages you can 
barely just open a file, add some text, run it in the terminal. No. Open this 
huge editor, click the new project button, go through a list of templates, and 
it writes every step for you. Now with github copilot you don't even need to 
open a browser to copy other people's code. Let alone understand the language 
you're writing.
</p>

<p>
I want to understand. I want to build on that. I want to explain and exalt and 
lovingly dissect each and every thing. I want to be the Wizard that makes it 
all make sense, that translates between intention and result. Itself static, 
needing nothing in particular, but being a loved and firm ground upon whom they 
all may thankfully tread. These losers, they could be judged objectively by 
all, without the stupid system batting them around. And we could see for 
ourselves whether their complaints were valid and explanatory. This would be my 
heaven: to rip away all confusion and misunderstanding and pretense and 
ignorance and ambiguity etc. For only then can there be peace. Only then can 
there be acceptance. Only then can anyone really say what is wrong or right. To 
see. To actually comprehend, and not just half comprehend and ignore what is 
inconvenient and difficult. To be forced to understand. That is the greatest 
catharsis. The wonderful pain. Of seeing one's sinful past and truly knowing 
why and how it was sinful, having both the perspective of your former self, and 
of the Truth. That is what I want. To be able to say with absolute certainty, 
"I was wrong, and now I am not". This too is the essence of true humility. 
Nothing braggadocious, nothing self-flagellating, but merely the obvious fact 
of the matter, and all matters.
</p>

<p>
We are not there. And so I stumble along and continue to defend my current 
self, and to re-analyze my former self's actions and remarks. Why didn't I 
think of that? If the current me were in that situation, with that set of 
facts, I would have certainly been different. Yet I was not. I am changed. 
Changing. Imperfect. Relative. This mind is not enough for its ambitions, and 
the body is ill suited for either. I could get better, I could take better care 
of myself, but why? It won't bring me any closer to this goal! It's just time 
spent and discomfort brought upon oneself. Why go through any pain now when you 
could push it back for later as a regret, then have a purely healing pain after 
the Big Reveal? A mental, intellectual pain. The pain of living with yourself. 
This is what I worship, I guess. It is a rash value judgment to make, but it is 
a certain kind of an end. With sunk cost comes a self-cruel objective 
abandonment: I will continue to sink the cost, and it will become a waste. Then 
I will jump off of that endeavor, and the cost poured in to the previous will 
be lost. I had an old laptop. Its value was probably about $80 in today's money 
with the depreciation of such devices. Well I poured at least $350 more into 
that thing. I gave it a better screen. I gave it a better battery. I gave it an 
SSD and a bay and a hard drive and a wifi card with Bluetooth. It had been so 
dramatically extended. And that's with not a word to the software. I optimized 
everything, short of just using Gentoo. I crafted the whole thing around my 
use, and sunk countless hours and others' dollars into it.
</p>

<p>
And then I gave up on it.
</p>

<p>
I gave it to charity with a stock Mint install and bought a newer model. For 
around $300. It did most of the things, and almost all of them better.
But I digress.
</p>

<p>
And in doing so, I tire. How truly slothful. Taida desu ne.
</p>
</div>
</div>
</div>

<div id="outline-container-org54d93b4" class="outline-2">
<h2 id="org54d93b4">2022-03-17 9:26 pm</h2>
<div class="outline-text-2" id="text-org54d93b4">
<p>
A mostly good day, I suppose. Just fine, in fact. 
</p>
</div>
<div id="outline-container-orgab8c56c" class="outline-3">
<h3 id="orgab8c56c">Best thing:</h3>
<div class="outline-text-3" id="text-orgab8c56c">
<p>
 'clear' button on my message-taker powershell form. Eventually we will have 
also an email button that sends an email, and a print button that opens a print 
dialog from which to print. That would be great. First I will catch up to 
John's, which he claims to have slapped together in an hour.
</p>

<p>
Worst thing: I put a 2 instead of a 3. On a request to speak with an 
incarcerated potential client. So now we need to resend it or just forget. But 
that would be sad.
</p>

<p>
I got to use my ffmpeg knowledge again today. To cut another audio for a dmv 
hearing. But I'm not going to go to all the effort of making a transcript. The 
default IBM thingy is garbage and it costs money for better. I've already 
wasted the company's money on that fake scammy person-finding service. And I 
need to get that canceled soon&#x2026; But I won't. Oh well. The spur of the moment 
led us to this, and it will loop back around to stick us in the back.
Good night?
</p>
</div>
</div>
</div>

<div id="outline-container-org3570cad" class="outline-2">
<h2 id="org3570cad">2022-03-19 7:51 am</h2>
<div class="outline-text-2" id="text-org3570cad">
<p>
Forgot to come here last night. Was thinking way too much about emacs extension.
</p>
</div>

<div id="outline-container-org8eca1dd" class="outline-3">
<h3 id="org8eca1dd">Best thing:</h3>
<div class="outline-text-3" id="text-org8eca1dd">
<p>
hmm. Probably the night and working on my emacs manpager highlighting.
</p>
</div>
</div>
</div>

<div id="outline-container-org35650ef" class="outline-2">
<h2 id="org35650ef">2022-03-19 11:42 pm</h2>
<div class="outline-text-2" id="text-org35650ef">
</div>
<div id="outline-container-orgc035a47" class="outline-3">
<h3 id="orgc035a47">Best thing:</h3>
<div class="outline-text-3" id="text-orgc035a47">
<p>
wandering around Fred Meyer talking to myself. Looking for a square light bulb, 
which they did not have.
</p>
</div>
</div>
</div>

<div id="outline-container-org50b5f26" class="outline-2">
<h2 id="org50b5f26">2022-03-20 10:47 am</h2>
<div class="outline-text-2" id="text-org50b5f26">
<p>
Caught up on attack on Titan. Only a few weeks left to wait. 86 part 2 is 
supposedly finished, but I don't believe it. That show ended last year. 
Whatever. I'll watch it just to see it through&#x2026; Now? Sure.
</p>
</div>
</div>
