musings_log.html

<div id="outline-container-org3c7e3d7" class="outline-2">
<h2 id="org3c7e3d7">2022-03-20 8:22 pm</h2>
<div class="outline-text-2" id="text-org3c7e3d7">
<p>
Set my alarm earlier. Might help for some reason. I really don't want to become 
grumpy and stiff like Jon. Well, whatever. Took a shower. Now the hair will be 
awful for a few days, then great for a couple of weeks, then get bad and 
require another shower. A miserable existence to be sure&#x2026;
</p>
</div>

<div id="outline-container-orgfde0f79" class="outline-3">
<h3 id="orgfde0f79">Best thing:</h3>
<div class="outline-text-3" id="text-orgfde0f79">
<p>
cleaning toilet. It turns out you can push all the water through the system and 
clear it out to scrub or treat the bowl. So that's nice maybe. Also cooking 
rice was good. I like rice when it's with things I like&#x2026; Hmm. Need to do 
something with the other stuff. More milk for the cheeto mac. More ramen 
packets. OK oh well.
</p>

<p>
I need to steel myself for another day week life of the office. To not get 
annoyed by Gene, or depressed by John, or fed up with Josh. Oh. Right. I have 
one mor more chore to do today&#x2026; Bye.
</p>
</div>
</div>
</div>

<div id="outline-container-orge971682" class="outline-2">
<h2 id="orge971682">2022-03-21 8:22 pm</h2>
<div class="outline-text-2" id="text-orge971682">
<p>
I guess that went okayly. Okaily? Okaly? OKly? Nah, OK is already the adverb. 
Well what evveth.
I didn't particularly fail today, but it all came off as disappointed of me. 
The chili of LA Cabana is always too much and it gives me a headache. A food 
headache, representing Gluttony. As opposed to a stress headache, representing 
Sloth. Hang on. This is subarashii desu. Is there a different headache for each 
Deadly Sin?
</p>

<p>
Food headache: Gluttony
</p>

<p>
Stress headache: Sloth
</p>

<p>
Argument headache: Pride
</p>

<p>
Exasperated headache: Wrath
</p>

<p>
Greed?
</p>

<p>
Lust?
</p>

<p>
Envy? <code>Jealousy, turning snakes into the sea.</code>
</p>

<p>
Oh well. A good metaphor, for another time.
</p>
</div>

<div id="outline-container-orgebd5626" class="outline-3">
<h3 id="orgebd5626">Best thing:</h3>
<div class="outline-text-3" id="text-orgebd5626">
<p>
waking up at 7 this morning in advance of the alarm. I'll set it back 5 minutes 
now and see how much I can each day.
</p>
</div>
</div>
</div>

<div id="outline-container-orge46b599" class="outline-2">
<h2 id="orge46b599">2022-03-22 8:49 pm</h2>
<div class="outline-text-2" id="text-orge46b599">
<p>
If I lose it all, then I lose it all. What a meme. Took me several episodes to 
get it. I was hearing Japanese so I couldn't make out the English. What a 
problem.
</p>

<p>
These past few days, there have been things I thought, "I should write this in 
the document" and then didn't. That's a thing I guess. Or rather, it is not.
</p>

<p>
I spoke with John about - - 
</p>
</div>
</div>

<div id="outline-container-org76c1915" class="outline-2">
<h2 id="org76c1915">2022-03-22 9:38 pm</h2>
<div class="outline-text-2" id="text-org76c1915">
<p>
Fitshucks and shitfucks. Clarice called about mom and ruined my evening. I gave 
everyone everyone else's numbers so they can leave me out of it.
</p>
</div>

<div id="outline-container-orgdbd2fbf" class="outline-3">
<h3 id="orgdbd2fbf">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgdbd2fbf">
<p>
If I Lose It All. Great meme.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdd85a0d" class="outline-2">
<h2 id="orgdd85a0d">2022-03-23 9:49 pm</h2>
<div class="outline-text-2" id="text-orgdd85a0d">
</div>
<div id="outline-container-org469d2a9" class="outline-3">
<h3 id="org469d2a9">Best thing:</h3>
<div class="outline-text-3" id="text-org469d2a9">
<p>
reinstalled server with Ubuntu Desktop Minimal instead of Debian. Just Werks, 
unlike the weird phantom wifi problems I had been having. Now I just need to 
make sure that the hotspot restarts itself on reboot. A venture for another 
time.
</p>

<p>
I can't get into this 'watching anime as it comes out' lifestyle. I've been 
sort of trying with attack on Titan since I caught all the way up, and the 
latest episode was just so much less impactful without that week long binge 
behind it.
</p>

<p>
Also&#x2026; Programming stuff.
</p>

<p>
I'm trying to grasp the essence of powershell so as to actually use it well. 
Here's a breakdown:
</p>

<ul class="org-ul">
<li>everything is an object, including strings. But the text on stdout is not</li>
</ul>
<p>
itself, but an arbitrary presentation of its underlying structure
</p>

<ul class="org-ul">
<li>objects are also shell variables like in sh, and evaluate to their content,</li>
</ul>
<p>
and can be set similarly
</p>

<ul class="org-ul">
<li>arithmetic is trivially simple including substitutions and parentheses</li>

<li>pipes work like in sh but wherever possible work in objects and not simple</li>
</ul>
<p>
strings. If you pipe into a legacy coreutil it will be treated as a raw string 
though.
</p>

<ul class="org-ul">
<li>in addition to variables (nouns) and commands (verbs) there are operators</li>
</ul>
<p>
like -ne or -replace which can change the result of the expression to a bool or 
modified string/variable object
</p>

<ul class="org-ul">
<li>Quotes are the same as in sh, parentheses are as in lisp but mostly optional,</li>
</ul>
<p>
the math is python math, the flags and switches are -single -dash like the Xorg 
tools, and the default verbs are ThisCase-Verbose ly long, as most are tapping 
into the Microsoft api.
</p>

<p>
Good night.
</p>
</div>
</div>
</div>

<div id="outline-container-org9babdce" class="outline-2">
<h2 id="org9babdce">2022-03-24 9:46 pm</h2>
<div class="outline-text-2" id="text-org9babdce">
<p>
Today, for the record, I high centered my car on the berm by the road. I was 
trying to slow down so as to not rear-end the rando in front of me. I veered 
into the side, then right over it, and found myself unable to move. I poked 
around with ice chunks for 10 minutes, then a good samaritan came and pulled me 
out. I offered him cash awkwardly, and he graciously refused. I was late to 
work, but John and Josh were later so it doesn't count. Josh brought donuts. 
Fresh donuts. I had forgotten donuts could be good, but these were subarashii. 
Did some more research on powershell stuff&#x2026; Not really though&#x2026; The emacs 
plugin does have a built in powershell dumb-terminal, so that's something. It's 
nigh trivial as a function, but it is something.
</p>

<p>
You know what's not something? Isekai.
</p>

<p>
Ooh, a tangent. Narnia the Magician's Nephew is an isekai, of the old kind 
where our guy wants to get back. I was just considering what I would do/think 
if I happened to get isekai'd, and what regrets I would carry or anything. 
Would I bring the Notch Apple back to my own dying mother? Would I attempt to 
contact my nakama to explain the event? Would I jump through hoops in that 
world to improve our own? Or even myself?
I don't know. I suspect if do the minimum necessary, and die like Subaru. 
Pointlessly, idiotically, dishonestly. And if I had to keep forward, I would 
lean on whatever the "twist" ends up being, till it failed me too. I would 
settle down and try for a white collar occupation that relies on my modern 
knowledge. And seek out all the infotainment there is in that world. If there 
would even be such a thing.
</p>

<p>
Other tangent: Would I be able to move our stories to this hypothetical isekai? 
The great epics of each generation: I suspect Homer would be a trivial port; 
Star Wars would fit just fine, Don Quixote is likewise omni-temporal. But these 
are plot-beated stories. What of mystery character technology drama? What of 
attack on Titan? What of (I could not think of another story of the same 
calibre).? So much is untranslatable in relation to the current and most 
fitting presentation. If I lose any, I lose it all. And if I lose it all, slip 
and fall, would you laugh at me.!?
</p>
</div>
</div>

<div id="outline-container-org5b5c4e9" class="outline-2">
<h2 id="org5b5c4e9">2022-03-25 10:20 pm</h2>
<div class="outline-text-2" id="text-org5b5c4e9">
<p>
Almost figured out printing in powershell. Or rather, I can get spacing or 
fonts but not yet both. A work in progress, but progress is being made at least.
</p>

<p>
Gave up on the whole server-and-hotspot thing for ThinkPad. Reset the router, 
it's doing its thing and routing the ports for ssh and https. Hopefully the 
dynu redirect will keep functioning. Hopefully&#x2026;
</p>

<p>
Also. Got some good progress switching from vim wiki to orgmode. Now I've just 
gotta write an amateur sed script to convert all the formatting. Or just do it 
manually. Or just not. Plus the  system-crafter guy has a guide on getting it 
all set up so that's good.
</p>
</div>

<div id="outline-container-orga18b56b" class="outline-3">
<h3 id="orga18b56b">Best thing:</h3>
<div class="outline-text-3" id="text-orga18b56b">
<p>
getting the site back up and working correctly. That is wonderful.
</p>
</div>
</div>
</div>
