org/musings_log.org
* 2022-03-26 10:34 pm
Watching Ascendence of a Bookworm. Exactly what I wanted in anime. Absolutely 
subarashii.
Also. Did some minor tweaking to emacs; I may just have to find another color 
scheme that actually works instead of my own hacked up nightmare...
Best thing: trying out doom emacs again and reading their docs. Gives a better 
perspective of what's out there to optimize.
Still not using their theme though.

* 2022-03-27 9:16 pm
Best thing: set up windows on the old dextop and simplified the Message script.

* 2022-03-28 7:48 pm
Best thing: simplifying the face definitions of my emacs colorscheme and 
working with the comment-delimiter stuff.
There's still more to do. I want to get all of Doom's org formatting in my 
fonts, and get the heading/ document structure figured out better. Or at least 
better fonts and colors.

* 2022-03-29 9:35 pm
Best thing: gui for ffcut script. Also super happy with my latest tweak to 
emacs: adding a better color to the variable-name face, which is also 
org-heading-2 for some reason. Previously it was very similar to my text face's 
off-yellow, which was not good. Now it's gray and thin. Maybe I should make it 
italic or underlined? Nah, that's too much. I want to keep this simple.
Man, all these dependencies take time to install and that's not good. Gotta 
eliminate a few. Once the colorscheme is done (ish) I can get rid of autothemer 
and just take its result. Also magit can go. I'm just not using it. Same with 
slime-- it's only good for automating nyxt, and nyxt does not work on any of my 
setups. Well that's an okay start to start with but there will need to be a lot 
more culling done later. The problem is, the defaults are just so bad. To make 
it bearable you need to disable all the gui bits, replace all the keybinds with 
a copy of vi, and hack ruthlessly at the cruft of ten thousand moons' 
optimizations for a bygone era.
Welp. I need to get up in the morning. Bye.

* 2022-03-30 9:07 pm
Best thing: rearranging the emacs color scheme. There's still a bunch of 
balance issues but I think it's getting better.

* 2022-03-31 11:33 pm
Best thing: deciding to walk to work tomorrow.
Also. Today I made the ffcut script download a static ffmpeg, since github 
doesn't let you upload files that big. I still want a progress bar, but for now 
this is fine.
For the Message script I need to chop up the text line. This can probably be 
done by counting a certain number of characters, finding the previous space, 
and converting it to a newline. And repeat until that is no longer possible 
obviously. I wish someone had already done that, but it'll be okay to do myself.

* 2022-04-01 10:17 pm
~How long, how long will I slide?~ (forever and ever amen)
~Suffer at the sight (I don't)~
~I don't believe it's better.~
Best thing: walking to work. Very relaxing. Also the paycheck. I've got an 
extra $300 plus another month of security.
Why do I struggle with human interactions? What do I gain from their confusion 
and pity? Well, I don't want to face them as an absolute. My absolute self is 
the hurricane, and I don't even care to look at it. Much less force others to.
Natsuki Subaru has "scary eyes". Shirogane Miyuki has "scary eyes". Ayanokoji 
Kiyotaka has dull eyes. I have weary eyes most of the time now. What does that 
mean? What eyes does Charles have? Can I ever look at him again, as anything?
I'm probably autistic. That's easy. But all the symptoms could also be from 
abuse. Was I abused? I remember nothing concrete. Only hating Dad for defying 
my little logic, and being glad to be stuck in Mom's nave box. In the box is 
peace and intermittent predictable isolation. She would give me free time based 
on work put in. Was it fair? Who knows anymore. But it was a good substitute. 
When dad was around, I was on edge. He made me come out and do things. Leave me 
the hell alone. Ive done my chore and a half, there is nothing to gain from 
sitting in the same room as you. You're just on your computer anyway. Maybe 
you'll make me listen to your sinful music. Maybe you'll rave about your stupid 
engine diagrams or amplifier circuits. Just leave me alone. Maybe you'll drag 
me on a hike to take the dog for a run. I'm in the middle of my daily cereal 
and comics. I'm not going. It'll be all soggy when I get back. I'll eat it now. 
At least give me 10 minutes to finish this part. Plus I have homework when I 
get back. I gotta do that now. This is my only reprieve today until I get to 
lie awake in bed for an hour. You are not taking this from me. Oh really. Well 
then. No more cereal and comics. Honey cancel the newspaper.
I'm in my room. Door is halfway open-- all the way open is wide and raw, closed 
or barely-ajar is hiding something. Building Legos quietly. Nothing else to do, 
but dad is here and he'll think of something if he remembers my existence. But 
I want this one part. I used a flashlight, it's right on the bottom of the 
drawer. If I sneak my hand in at just such an angle, my fingers should-- "I 
hear rustling. Mitch, get out here. What are you doing?" nothing. Like I 
should. I'm oppressed and you are bearing down on me like some	 kyojin I can't 
shingeki. I just want to live in peace. without you. Leave me alone. leave me 
alone. The fucking leave me the bloody damned hell a freaking lone. All I ever 
wanted to do was mind my own business and spend your money on toys and make up 
inane plots. Whenever you're around, I make no progress. When you leave, I have 
to compensate by making thrice as much sound, or getting on the forbidden 
computer, or going out to get candy to consume. I have to have it. You won't 
give it so I will take it. I will turn the whole house upside down if need be. 
I will find it all. Every computer, every candy stash. Every thing I can use 
and enjoy in secret, I will. You will tell me I was wrong, I will agree with my 
lips, but I will regret only being caught. I will carry out my punishments to 
the most barely sufficient degree, and move on to the next iteration. Until you 
give up. Until I am "worthy". Until I am "mature". "older". Oh stop. I'll never 
be good enough for you. You gave me my own computer to shut me up. You took it 
away because I gave you an excuse. It was all so pathetic from all of us.
Is that abuse? Yet my father says he is not abusive. And my father is an 
honorable man.
I have some choice words about Mom's role in all of this. Specifically, that 
she and her nearsighted good intentions created every stressful situation in my 
childhood. But that is for not-now.

