org/musings_log.org
* 2022-04-02 10:05 pm
Yay. Hooray. Here's another bad take.
Realist Hero is a good show. It's lacking in filler and full of 10 billion iq 
plays. The reference implementation of the intellectual's isekai power fantasy 
harem. I love it. It's reasonable and inspiring and hot. The plot has no 
obvious gaping holes, and if it did they would be explained anyway. I will 
eagerly await the next installment. This is still pretty early and they haven't 
even finished introducing characters, it seems. Lots of good potential there. 
Also. The romance. Can it even be called romance? Is romance a valid and 
iterable concept? Whatever. This particular isekai has legal polygamy, so yeah. 
Our boy the Realist Hero king is going to keep collecting waifus, that much is 
for certain. I love to see him succeed, but I'm slightly disappointed. Waifus 
#4 merchant princess brown edition was set up to be this puppeteering shadow 
alt-tagonist. She's a good character in her own right and had mentioned having 
her own agenda. And yet, her grand ploy is just to marry protag-kun and annex 
her lands to him. Okay other topic on the same show. Strangely, protag-kun 
despite actually being married to his obvious love interests, has not sexed 
them yet. Is it to keep his energy up because the act is draining? Is he afraid 
of getting too close or something? Is he worried about his public image? Or is 
he consciously aware of and seeking to preserve that isekai stereotype of the 
perpetually celibate harem? I mean, mad respect and restraint. Or maybe he's 
like me and has a terrible relationship with his sexuality and doesn't trust 
his stamina or body image with anyone else. Nah. He's probably just reasonably 
modest and a little shy and very preoccupied.
Best thing of today: working out putting a title on the site without it showing 
as a visual heading. That was good.
I'm tired. I'm depressed. I haven't met with any friends in about a month at 
least. Not since that retreat I ducked out of. I need new friends, but it's not 
that quick and easy...
At least I'm not on reddit. That has helped tremendously.

* 2022-04-03 9:30 pm
This document is huge. It's going to take a while to open every day unless I do 
something about it. Which I might. I sort of was planning to upload it to the 
website anyway.
A couple best things today:
- finally fixed line indentation on the Message script. Now I just need a basic 
email function and it will have surpassed John's.
- merged the self-hosted site with the github version. Now I can edit stuff any 
way whatsoever and it will appear on the github version instantly ish, and my 
own when I manually rebuild it.
Yes. It was probably a good day. My ears are lightly ringing, and I'm not sure 
how to feel about that. I only notice it when nothing is happening and I seek 
it out. But right now it's here and it won't go away.
I saw an article over a month ago, maybe less, about a Japanese kid who 
crunched the numbers of how hard various hiragana were to write. He assigned 
point values to straight and curved lines, then added them together for each 
letter. This is a thumbs up from me. It's something that's always been in the 
back of my mind, especially about Asian writing systems with lots of complex 
characters. But. The author of the article said that he was in awe in part 
because when he were that age, he would have said that the hardest letter to 
write was B because he didn't like broccoli. And there's just something so 
pathetic about that. This author was doomed from the start, and his attempt to 
endear himself just exemplifies his own idiocy. He never knew logic. It was as 
a third language to him, something that could be admired and pantonmimed, but 
never understood, never natively spoken. So he calls the kid /subarashii/ and 
himself a baka. He is aware of this, but not the implications. There is a 
sadness to it. Like Chris Chan. Like he is aware that he is a fool, and his 
work is worth nothing, and this pains him. Yet he cannot do anything about it 
nor reflect. For he is a fool and his work is worth nothing.
I bought a couple of pizzas today. I wonder: if I cut a slice off the frozen 
pizza and cook it on its own, does that work? Will it come out okay? Only time 
will tell. I'll finish the last of the first pizza tomorrow. Then can come the 
experiments...

* 2022-04-05 7:26 pm
I missed yesterday. I missed yesterday? Hmm. Best thing of yesterday: Jon 
telling me that he can hear minds. I basically believe it, too.
Best thing of today: starting to rewrite conan-dl in powershell this morning. 
It was all downhill from there though.
So. I think I have to start doing something else. In addition to the current 
stuff. I'm wasting a lot of time right now as it is. The intention is to 
gradually crank the sleep time earlier and earlier, to reclaim the morning 
pre-work. That way I can do more things on that first burst of energy, be 
depressed for work which is fine because Jon is depressed already so he might 
not notice, and might even be nicer to me. Then I go home and crash. And then 
wake up around 8 or 9 for a couple hours to eat or watch YT or whatever and 
sleep from 11 to 5. That's a very rough guesstimate and there's something wrong 
with it.
The problem with this is that it's light out and I have luxurious windows. 
Let's see. I can close the door, and put a thingy over the window in here. That 
could work. Let's try it. If I'm to train myself to wake up before the alarm, 
it must not be light-related.
I hereby wish my immediate future self luck!

