musings_log.html

<div id="outline-container-org134b0e3" class="outline-2">
<h2 id="org134b0e3">2022-04-06 8:50 pm</h2>
<div class="outline-text-2" id="text-org134b0e3">
<p>
Well that didn't work. At all? Not really. Not very much.
</p>
</div>

<div id="outline-container-org4daf5e5" class="outline-3">
<h3 id="org4daf5e5">Best thing of today:</h3>
<div class="outline-text-3" id="text-org4daf5e5">
<p>
 idk it was awful. I've felt like that every day lately. Maybe, I need to make 
a change. Definitely, rather. Best thing for real today: starting this anime. 
It's got a stupid long poorly translated title: something like "isekai'd with 
my fellow old man friend who is now an impossibly beautiful girl". It's popcorn 
but doesn't get stuck in the teeth. So chips but not corrosively salty. So 
perfect basically.
</p>

<p>
I haven't finished it so there's not much to say. Lead guys are both relatable, 
lead girl is hot/cute (how far have I sunk that I can say that), visual 
exaggerations are on point if overly frequent. But again I'm only 2 episodes in 
so can't say.
</p>

<p>
You know what I'm way further into? Re:zero. I've caught up with the real 
translations and am now left with proofread machine-translations. But the 
machine is excellent at its job. The quality is indistinguishable. So. Subaru 
is sort of a weird case of male. Not worthy of being Alpha, not independent 
enough to be a Sigma, but will not submit to anyone. He meets the sigma emperor 
of Vollachia, goes through hell with him, and then clashes and distrusts him. 
And flares up at the guy constantly. Like, if I were in Subaru's place I would 
immediately swear fealty to the guy. I would also have kissed up to Julius in 
season 1 though, so that changes the timeline quite a bit already.
</p>

<p>
Did Subaru watch steins;gate? He mentions world lines a few times. Is that 
sekaisen, or another compound term? Huh. Oh well.
</p>

<p>
I've had a headache all afternoon ish. Why. I don't understand. Stop.
</p>

<p>
My tongue feels too big for my mouth. My eyes itch when I cry. My nose only 
works halfway and it switches without warning. My penis leaks droplets and 
leaves a stain on my pants. My ears feel clogged but I can hear everything. All 
my major joints have fat-folded skin behind them that looks like something out 
of snk with no magic regeneration or Titan powers. Basically, my whole body 
already feels like it's falling apart slowly. I can't imagine being John or 
Gene's age. To be in constant pain, to abandon an extremity and watch it rot 
and fall away, to lose sight and memory and adaptability. To see all the 
current days run together, to be unable to experience without comparing to your 
youth, to yell on the phone and misuse technology that should be simple. You 
should be smart enough to understand it. You're a smart person. How can you not 
comprehend one more thing? But that is the curse of age. You become like 
Chris-Chan or that reporter. You can see that you have become a pathetic 
existence, and even see how. But you are pathetic, so it brings you only 
fruitless pain, so you stay in your ever-shrinking box, to reign over your 
melting domain for as long as you have left.
</p>

<p>
I cannot stand that. I wouldn't want to be in that sort of world that I can see 
my link with crumbling. Build me a little padded static world I can live out my 
days in, with no challenges. Then I shall be content. Actually, do it now and I 
would be even more content.
</p>
</div>
</div>
</div>

<div id="outline-container-org23bdeff" class="outline-2">
<h2 id="org23bdeff">2022-04-07 8:56 pm</h2>
<div class="outline-text-2" id="text-org23bdeff">
<p>
Another day. Ate too much ice cream and now I won't be able to sleep for a 
while.
</p>

<p>
Mom is stupid. She doesn't read my texts. She keeps asking me to come over and 
fix the lamp. She's moving out in 2 days! She doesn't need that lamp! I will 
not interact with her anymore. This is a garbage situation and the least I can 
do is stay out of it.
</p>

<p>
I also just want an excuse to not see her. She pains me and has for years. I 
wish she'd go. Go to Spokane or something, stop ruining my life up here. Then I 
can go back to church and give her downfall as the backstory of my conversion. 
What a convenient and subarashii tale. Only my confidanti would know the truth, 
that the church is mostly aesthetic to me and I left because I couldn't stand 
her. Ah yes. All that will unfold in due time.
</p>

<p>
Originally the plan was for her to die, but this is a lot cleaner and actually 
under way already. Kamisama, I really ought to be thanking you.
Of course, there's a whole lot of other things I want to be before this is all 
over&#x2026;
</p>

<p>
Once I get a little more in shape, I can start researching hormone 
manipulation. I want to not have the urge to masturbate. That's it. Mostly. 
Also it would be kind of fun to have breasts, and convenient not to have to 
shave&#x2026; There's probably some huge downside to it I haven't heard of because 
of the propaganda.
</p>

<p>
Of the 2 sexes, I'd much rather be male. There's no inherent pain, your base 
strength stat is at least functional, and you can be largely level-headed at 
any given time. I would never choose to be born a woman. Periods alone sounds 
like hell. And it's all the time. Well, a solid quarter of the time. Plus women 
are a more toxic community and male society doesn't respect women enough.
</p>

<p>
But if I got to pick the best traits from each sex, I would prefer a female 
phisyque with male plumbing. Roughly. Aach. I'm being lazy. I just don't want 
to shave. I don't want to shave, I don't want random boners, I want female 
friends. I guess I'm no better than Chris Chan in that regard. But. I would 
never identify as a woman. I'd sooner be gay. Wouldn't mind being gay, in fact. 
If it was a guy I could really share a future with.
</p>

<p>
Because really, that's what I want. I just want a companion who I can talk with 
who will support me and be there and that I can learn more about. I want 
someone to love, somebody to love me. A hug. Please God I need a hug. Anybody. 
Hug me. Guess I'm no better than Sockness in that regard&#x2026;
</p>

<p>
Oh right.
</p>
</div>
<div id="outline-container-org1dd020f" class="outline-3">
<h3 id="org1dd020f">Best thing of today:</h3>
<div class="outline-text-3" id="text-org1dd020f">
<p>
abstracting parts of the scripts into a separate file. And next time I may do 
some sort of exe compilation. Hopefully that will hide the host window better 
than my current solution&#x2026;
</p>

<p>
Ooh. An idea to work on to maybe help. A goal for tomorrow.
</p>

<p>
Goal for tomorrow: make ffcut smooth. Progress bar at least.
</p>

<p>
Satte. Oyasumi.
</p>
</div>
</div>
</div>

<div id="outline-container-orge6c555e" class="outline-2">
<h2 id="orge6c555e">2022-04-08 10:45 am</h2>
<div class="outline-text-2" id="text-orge6c555e">
<p>
Today is Mary Alice's birthday. For all the nil that's worth. Random pointless 
aside.
Anyway.
</p>

<p>
New discovery: in Emacs you can type C-\ and it will bring up a list of input 
methods. This is independent of the OS and translates the keystrokes the same 
way as emacs key chords. It has Japanese. We can type raw phonetic Japanese and 
it will look real and readable.
Now the problem is katakana and Kanji. No idea what to do about those. Is there 
already something built in? Probably. Yay. Happy happy fun times. Just wanted 
to add this to the record before I forget&#x2026;
</p>
</div>
</div>

<div id="outline-container-orgedfc303" class="outline-2">
<h2 id="orgedfc303">2022-04-08 4:39 pm</h2>
<div class="outline-text-2" id="text-orgedfc303">
<p>
Another emacs thing:
global-whitespace-mode for tab visualization.
</p>
</div>
</div>

<div id="outline-container-orge0d34bc" class="outline-2">
<h2 id="orge0d34bc">2022-04-08 10:47 pm</h2>
<div class="outline-text-2" id="text-orge0d34bc">
<p>
Both above emacs things are now incorporated into my configuration. Hooray.
</p>
</div>

<div id="outline-container-org938d06d" class="outline-3">
<h3 id="org938d06d">Best thing of today:</h3>
<div class="outline-text-3" id="text-org938d06d">
<p>
 getting Japanese input and whitespace visualization on emacs. It's like in the 
movies, literally. You just type and it converts the characters.
</p>

<p>
Now what we need is to merge quail (the emacs foreign input system) into 
ivy/counsel&#x2026;
</p>

<p>
I'm tired. Good night.
</p>
</div>
</div>
</div>
