org/musings_log.org
* 2022-04-09 11:14 pm
Best thing of today: optimizing emacs startup time. It was getting up to a 
second there until today. Now it's about half. I'd prefer even less, but this 
is fine for now.

* 2022-04-10 5:58 pm
Finally got space bar prefixes on emacs figured out. Haven't implemented them 
yet but they're figured out at least. Using general.el for all keybindings 
seems to be working out.
I successfully shunted away both parents' appointments with me yesterday. Mom 
by disappointing her sorry self, and dad by not needing his help.
The apartment has been cold today. Figures, since I have the heat cranked way 
down. Me plus the sun are probably sufficient to maintain a good enough 
temperature for the system as currently configured. My toes are cold, but the 
rest of me is fine. It might be a good thing, since I have to burn more energy 
to just exist. But then again, when it's warm I sweat too much anyway and 
that's tiring and uncomfortable. Plus when it's hot the bedbugs come out. When 
it's cold like this we can pretty well pretend they don't exist, since they 
deactivate in the cold. Or something.

* 2022-04-10 9:01 pm
Best thing of today: tackling emacs prefix keys. Soon I will have everything on 
spacebar and need no modifier keys. No control, no meta. And hopefully in a 
remember-able way.
It's a good day. I have been saved. I am not Chris Chan. Thus I shall endure.

* 2022-04-11 9:21 pm
Best thing of today: adding treemacs and minimap to emacs. The minimap is kind 
of broken, but it's fine for now. I think the implementation is rather fraught, 
inherently, but surprisingly there are only 2 and the other one is worse. 
Treemacs is also fine. The least janky out of the options in one random list. 
Also has git integration which is neat I guess.
Things go by in a whirl. It's already April 11th. In a month the others will 
get out of school and have summer free time all day. And I won't. I'll be stuck 
in the office. Making bank. And maybe I'll save a thousand dollars, and maybe 
I'll find a shorter job, and maybe I'll get some friends somehow, and hang out 
all day long.
Kind of doubt that last one. But hey, there's always a chance.
Most of my friends so far have been circumstantial. You meet them, try being 
enemies, get tired of that, and confide in each other and get up to 
lesser-good. And then your circumstances stop aligning, and nothing. It's like 
a switch. Was it my idea to break contact? Or theirs? Both, and neither. We 
just couldn't bring ourselves to go that far out of our way. The bond we shared 
was wide but shallow. There is always of course the repulsion factor. Like 
malformed magnets that push each other apart unless you get them really close, 
then they stick tightly. When you pull them apart, they'll never reconnect on 
their own.
Or maybe I'm just antisocial, or maybe I'm too emotional, or maybe I'm just 
afraid of what they'd say.
I'm blaming society. It separates us. I'm a year ahead, thus I as an adult am 
on a completely different plane of existence. It's the same reason I didn't go 
on that retreat. I'm not ready to be a leader. To the extent that I've ever 
been a student/subordinate/etc, I still am. I feel exactly the same and I 
relate most to that status and those fellows. To be in a managerial position 
for me is to have lost. I'd do it if I had to, but I always think of myself as 
the lowest rung. The top of the lowest rung. It's exactly like that at the 
office. That is part of my current contentment. I am the lowest position, 
second assistant and discovery enumerator, but I am the best one they've ever 
had. All of my obligations are:
- confined to the office,
- either
   1. Consistent and scripted; or
   2. Immediate and simple.
This is ideal. No homework, very few curve-balls. But plenty of busy work that 
is necessary and on a soft time deadline.
What does this account say about me? What does it say about you for reading it? 
That is something only we together can answer. May you by reading this 
assimilate my mind, and judge for yourself truly.

* 2022-04-12 9:35 pm
I just set up the file syncer, so it might or might not have sync'd up. Let's 
check.

* 2022-04-12 10:56 pm
Best thing: notes sync. I don't even care if it actually worked. Today was 
vicariously stressful and I did nothing else of note.

* 2022-04-13 6:24 pm
Bad day. But got bone-conduction headphones so that's nice.

* 2022-04-13 6:36 pm
Testing. Did the sync work? Did it?
Apparently so.
I just went in and fixed all the date headings, and a few of the song lyric 
bits...

* 2022-04-13 7:32 pm
And now maybe the line breaks will work. Maybe. Pray to the capricious regex 
gods...
No. It didn't. Whatever. Not like I want anyone to read this...
Hmm.

* 2022-04-13 9:56 pm
Best thing: working out the note syncing. The only other good thing that 
happened was hanging foil on the window. Maybe I'll be able to sleep earlier 
now.

* 2022-04-14 9:26 pm
Best thing of today: waking up early and taking a shower.
Okay, hmm. Ani-cli broke again. Might have to switch to anime-dl if that's a 
thing. Which it definitely is.

* 2022-04-14 10:07 pm
Well, I'm trying again with converting ani-cli to powershell. I actually 
nanaged to appease the linter, so that's at least a start. However the output 
looks like this:
#+begin_src
False
False
$*
False
$*
#+end_src
Clearly, something is wrong. I blame the syntax differences.
Powershell is wonderful. Absolutely crazy. Like sh but doesn't get in your way.

