musings_log.html

<div id="outline-container-org5b7cfd6" class="outline-2">
<h2 id="org5b7cfd6">2022-04-16 7:39 pm</h2>
<div class="outline-text-2" id="text-org5b7cfd6">
<p>
I missed yesterday, apparently. Didn't notice at all. Best thing of yesterday: 
porting John's email button in the script from visual basic to powershell. Even 
if it's still mysteriously broken. Just having a reference is a big help.
</p>

<p>
Did I lose time? I legit can't remember much from yesterday. I didn't wake up 
early, the alarm was My War (from attack on Titan), at work I did the email 
thing and a bunch of discovery, and I must have had cheeto Mac in the evening 
because the tupperware was oily and orange. Oh yeah. We had subway for lunch 
and Josh was late picking it up.
</p>
</div>

<div id="outline-container-orgcea29be" class="outline-3">
<h3 id="orgcea29be">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgcea29be">
<p>
 fixing the READMEs for my dotfiles. Also the tangent that that led me on led 
to using zplug to manage more things was pretty useful. I want to do more with 
that sooner or later. But for now the next thing is to auto-tangle all those 
org files. Ideally both on save and when deploying a new system. There's gotta 
be a way to do that, right? Well I'll find it. And do all the other things as 
well. If I could manage everything with zplug that would be supremely 
convenient&#x2026;
What has this file become? All I do is gush about my pseudo-programming 
escapades. Where are the hot takes? The rants? The reviews? They're all in my 
head, and I'm not in the space to let them out lately. I'm pretty full right 
now&#x2026;
</p>

<p>
Tomorrow I may or may not go to Dad's for Easter. May as well, except for the 
whole gas thing. Well, I've got some 20s in the car, 30ish in my pocket, and 10 
extra in savings. That's an amount. I can drive to Eagle River Carrs, 
deposit/transfer at the atm, and get gas there too.
</p>

<p>
Or I could just not. And chill here, and watch anime and program all day, and 
snack on the last of my chips and salsa, then cook a spoonful of over-seasoned 
rice. I really have to find a better use for that rice. Ooh. Frozen 
blueberries, milk, cinnamon, ginger. Boil the rice, simmer in blueberries, stir 
in ginger, dust with cinnamon. I feel less bloated just thinking about it. But 
still bloated.
</p>

<p>
The car is going to be trouble. I need to get my studs off. Ooh. I'll do that 
in Palmer. There's a place by dad's. And I can walk. I need to get some 
exercise. Any at all.
</p>
</div>
</div>
</div>

<div id="outline-container-org4aba299" class="outline-2">
<h2 id="org4aba299">2022-04-17 10:06 pm</h2>
<div class="outline-text-2" id="text-org4aba299">
<p>
Why, oh why. Did I go. To dad's. I wasted like 5 hours and a good amount of 
gas, and for what? Well, I at least got the tires. Need to change those very 
soon&#x2026; Like a week ago&#x2026;
</p>
</div>

<div id="outline-container-org08192ca" class="outline-3">
<h3 id="org08192ca">Best thing of today:</h3>
<div class="outline-text-3" id="text-org08192ca">
<p>
laying here now. Tired but resigned. I need nothing else.
</p>
</div>
</div>
</div>

<div id="outline-container-orge76b1c2" class="outline-2">
<h2 id="orge76b1c2">2022-04-18 9:32 pm</h2>
<div class="outline-text-2" id="text-orge76b1c2">
<p>
<code>I need something else, to get me through this</code> stupid song. Darn stupid 
innuendic songs. I can't stand it. I've stood it for a while now, what happened 
was nothing.
</p>

<p>
Father Arthur called me today. I was real with him for once. I told him that my 
piety was aesthetic. I told him I was staying away from mass because I didn't 
want to run into mom. He accepted it all and told me that I can use my powers 
for good or for evil. Hmm. Yeah, I bet. I told him I didn't want to go to 
college because homework and stress. He said to wait and when I get to it it 
won't be like I remember. I think he may have been a bit overwhelmed by how 
much I shared. Oh well. That is one affliction with which I am cursed.
</p>
</div>

<div id="outline-container-orgc3a2dbe" class="outline-3">
<h3 id="orgc3a2dbe">Best thing of today:</h3>
<div class="outline-text-3" id="text-orgc3a2dbe">
<p>
sending email works. In powershell. Now I just have to give feedback on it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc13addd" class="outline-2">
<h2 id="orgc13addd">2022-04-19 8:12 am</h2>
<div class="outline-text-2" id="text-orgc13addd">
<p>
Jon out today. Guess I'll just sit here and do nothing. Nah, I'll do something 
at least. May as well.
</p>

<p>
Well, I restarted the ordeal of rewriting ani-cli in powershell. Copying the 
i/o of each function, but writing them idiomatically to powershell. It'll be 
good this time. I don't have complete certainty, but I have faith in myself.
</p>

<p>
Doom. Depression. Desperation. ~so far away, we wait for the day / for the 
light's also wasted and gone / we feel the pain of a lifetime lost in a 
thousand days /through the fire and the flames we carry on~
</p>

<p>
I am a kid. A child. I believe in children. Is that all that means to me? I am 
a grown up. Adulting all over the place. I got a life and a job and a place to 
live. And yet. I am not "an adult like them". To grow up is to kill your old 
self. To want to do things that are stupid and that you shouldn't want to do, 
that society demands. To enslave yourself to the system. "I have to do my 
taxes" so you want to. "no, but I have to" so you do them willingly despite not 
"wanting" to do them. Truly pathetic. Just admit that you like it. If you 
didn't, you would resist with all your everything, and make up for it later. To 
submit is to submit willingly. And to be willing is to want. When this all 
shakes out, you want this.
</p>

<p>
What do I want? <code>I want to shine down, on the hearts of man, I want to take it 
from the back of my broken hands</code>. Well, sort of.
</p>
</div>
</div>

<div id="outline-container-org5ced5a3" class="outline-2">
<h2 id="org5ced5a3">2022-04-19 9:50 pm</h2>
<div class="outline-text-2" id="text-org5ced5a3">
<p>
My ears are ringing. They start whenever I don't have anything to listen to or 
concentrate on. If I stop listening to it, it goes away until the next time. I 
pop my ears and pressurize my sinuses. But nope. It endures.
</p>

<p>
Worst thing of today: all of work.
</p>
</div>

<div id="outline-container-org0dfd86e" class="outline-3">
<h3 id="org0dfd86e">Best thing of today:</h3>
<div class="outline-text-3" id="text-org0dfd86e">
<p>
 working with powershell string manipulation for the ani-cli rewrite. Most of 
the logic is simple to port, but I'm not sure how to handle passing multi-line 
stdin to a While loop. I guess just use For and pipe into .Add($_) if they'll 
let me.
</p>
</div>
</div>
</div>

<div id="outline-container-org4309e60" class="outline-2">
<h2 id="org4309e60">2022-04-20</h2>
<div class="outline-text-2" id="text-org4309e60">
<p>
My headache is splitting. I cannot think, I cannot live. I'm just sitting and 
breathing and listening to the ringing of my ears.
</p>
</div>

<div id="outline-container-org0aa7c1a" class="outline-3">
<h3 id="org0aa7c1a">Best thing of today:</h3>
<div class="outline-text-3" id="text-org0aa7c1a">
<p>
 not getting pulled over this morning. There was a cop right there and he 
didn't even look my way.
</p>
</div>
</div>
</div>
