org/musings_log.org
* 2022-04-21 8:29 pm
My brain no longer trembles, but the throat is ravaged and my shoulders want to 
fall off. Weird. Unpleasant, but not quite as bad as yesterday. Nay, so much 
better than yesterday. Last night I was up the whole time having nightmares 
about GiBi and powershell recursion and entitled criminals. And having to pee, 
of course.
Well, I went to the store and got some chicken soup and a pot pie. I ate the 
pot pie. Burnt my tongue a little bit but could still mostly taste. Also, whole 
milk is the best. Very underrated.
I watched Dress Up Darling today. Wholesome and original, but it's total 
waifu-bait ecchi garbage. Makes up for a cringe and inevitable plot with sexy 
animation. That's my brief rambling review. It's probably wrong because 
everyone on YouTube says it's fantastic. Well, whatever. At least I'm not 
blindly following somebody's takes on it like I do for most things.
Best thing of today: walking around Fred Meyer. I almost felt normal.

2022-04-22 10:34 pm
The ache is pretty much gone from my shoulders. But my throat is scabbing 
itself over a lot. Does it not know how to heal? Nah, it shall heal in time.
Best thing of today: getting a good version of Emacs for macos installed. The 
built-in webkit browser almost doesn't not work. Only problem, I use emacs as a 
transient process and not as a daemon or root window. Thus having to open and 
close the browser along with the editor all the time. Not ideal.

* 2022-04-23 3:40 pm
Current at random tire shop #1 waiting on my car. The one Jon gave me didn't 
answer.

* 2022-04-23 8:51 pm
Best thing of today: walking around after dropping off the car. Didn't get 
anywhere but at least I burned energy.

* 2022-04-24 8:33 pm
Just watched (finished) Serial Experiments Lain...
** Quick rant/review: Serial Experiments Lain
So, um, it's like, if, uh, The Matrix were depressed and suicidal and, uh, umm 
like deep and stuff, kinda reminded me of Steins gate for no reason, and uh, 
like, computers are crazy yo, and like what is this setting? So yeah. Cathartic 
plot collapse out of 10; must watch.
** best thing of today:
 getting blazers out of car. Needed to happen for months now.

* 2022-04-25 8:42 pm
Best thing of today: shower in the morning. All downhill from there, now my 
headache is back. Night.

* 2022-04-26 10:05 pm
Best thing of today: installing the new Ubuntu. It's broken so I'll have to go 
back to fedora, though. That can wait till tomorrow.

* 2022-04-27 10:08 am
At work right now, might randomly trail off.
I used to be good with people. I used to not get flight or fight reactions when 
going up against a crowd.

