musings_log.html

<div id="outline-container-orgf75a29a" class="outline-2">
<h2 id="orgf75a29a">2022-04-21 8:29 pm</h2>
<div class="outline-text-2" id="text-orgf75a29a">
<p>
My brain no longer trembles, but the throat is ravaged and my shoulders want to 
fall off. Weird. Unpleasant, but not quite as bad as yesterday. Nay, so much 
better than yesterday. Last night I was up the whole time having nightmares 
about GiBi and powershell recursion and entitled criminals. And having to pee, 
of course.
</p>

<p>
Well, I went to the store and got some chicken soup and a pot pie. I ate the 
pot pie. Burnt my tongue a little bit but could still mostly taste. Also, whole 
milk is the best. Very underrated.
</p>

<p>
I watched Dress Up Darling today. Wholesome and original, but it's total 
waifu-bait ecchi garbage. Makes up for a cringe and inevitable plot with sexy 
animation. That's my brief rambling review. It's probably wrong because 
everyone on YouTube says it's fantastic. Well, whatever. At least I'm not 
blindly following somebody's takes on it like I do for most things.
</p>
</div>

<div id="outline-container-orge0ddd50" class="outline-3">
<h3 id="orge0ddd50">Best thing of today:</h3>
<div class="outline-text-3" id="text-orge0ddd50">
<p>
walking around Fred Meyer. I almost felt normal.
</p>

<p>
2022-04-22 10:34 pm
The ache is pretty much gone from my shoulders. But my throat is scabbing 
itself over a lot. Does it not know how to heal? Nah, it shall heal in time.
</p>
</div>
</div>

<div id="outline-container-orge0f9dee" class="outline-3">
<h3 id="orge0f9dee">Best thing of today:</h3>
<div class="outline-text-3" id="text-orge0f9dee">
<p>
 getting a good version of Emacs for macos installed. The built-in webkit 
browser almost doesn't not work. Only problem, I use emacs as a transient 
process and not as a daemon or root window. Thus having to open and close the 
browser along with the editor all the time. Not ideal.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb27840a" class="outline-2">
<h2 id="orgb27840a">2022-04-23 3:40 pm</h2>
<div class="outline-text-2" id="text-orgb27840a">
<p>
Current at random tire shop #1 waiting on my car. The one Jon gave me didn't 
answer.
</p>
</div>
</div>

<div id="outline-container-org94a8c06" class="outline-2">
<h2 id="org94a8c06">2022-04-23 8:51 pm</h2>
<div class="outline-text-2" id="text-org94a8c06">
</div>
<div id="outline-container-orga378b48" class="outline-3">
<h3 id="orga378b48">Best thing of today:</h3>
<div class="outline-text-3" id="text-orga378b48">
<p>
walking around after dropping off the car. Didn't get anywhere but at least I 
burned energy.
</p>
</div>
</div>
</div>

<div id="outline-container-org5019a3d" class="outline-2">
<h2 id="org5019a3d">2022-04-24 8:33 pm</h2>
<div class="outline-text-2" id="text-org5019a3d">
<p>
Just watched (finished) Serial Experiments Lain&#x2026;
</p>
</div>

<div id="outline-container-orgfaaaecb" class="outline-3">
<h3 id="orgfaaaecb">Quick rant/review: Serial Experiments Lain</h3>
<div class="outline-text-3" id="text-orgfaaaecb">
<p>
So, um, it's like, if, uh, The Matrix were depressed and suicidal and, uh, umm 
like deep and stuff, kinda reminded me of Steins gate for no reason, and uh, 
like, computers are crazy yo, and like what is this setting? So yeah. Cathartic 
plot collapse out of 10; must watch.
</p>
</div>
</div>

<div id="outline-container-org58f7b67" class="outline-3">
<h3 id="org58f7b67">best thing of today:</h3>
<div class="outline-text-3" id="text-org58f7b67">
<p>
getting blazers out of car. Needed to happen for months now.
</p>
</div>
</div>
</div>

<div id="outline-container-org52c4245" class="outline-2">
<h2 id="org52c4245">2022-04-25 8:42 pm</h2>
<div class="outline-text-2" id="text-org52c4245">
</div>
<div id="outline-container-org0ec45a5" class="outline-3">
<h3 id="org0ec45a5">Best thing of today:</h3>
<div class="outline-text-3" id="text-org0ec45a5">
<p>
shower in the morning. All downhill from there, now my headache is back. Night.
</p>
</div>
</div>
</div>

<div id="outline-container-orgde857f1" class="outline-2">
<h2 id="orgde857f1">2022-04-26 10:05 pm</h2>
<div class="outline-text-2" id="text-orgde857f1">
</div>
<div id="outline-container-org8195e57" class="outline-3">
<h3 id="org8195e57">Best thing of today:</h3>
<div class="outline-text-3" id="text-org8195e57">
<p>
 installing the new Ubuntu. It's broken so I'll have to go back to fedora, 
though. That can wait till tomorrow.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd0bf036" class="outline-2">
<h2 id="orgd0bf036">2022-04-27 10:08 am</h2>
<div class="outline-text-2" id="text-orgd0bf036">
<p>
At work right now, might randomly trail off.
I used to be good with people. I used to not get flight or fight reactions when 
going up against a crowd.
</p>
</div>
</div>
